{"url": "https://tiatmumbai.in/admission-enquiry.php", "content": "Zagdu Singh Charitable Trust’s Thakur Insititute of Aviation Technology,\r\n              Thakur Complex, 90 Feet Road,\r\n              Near Western Express Highway, Kandivali(E). Mumbai – 400 101 Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in Kindly mail us for further information or enquiry. tiat@thakureducation.org Mr. Subhajit Maity (Accountable Manager) – 022 28542481 Extn. 361 Mr. Vivek Kulkarni (Technical Instructor) – 022 28542481 Extn. 365 NEWS FLASH × Admission Enquiry Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Admission Enquiry Form contact info About TIAT Quick links Contact us Just call for more information Please fill the details Admission Enquiry 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/", "content": "is a highly respected\r\n                            education brand established in March 2006 with a motive to provide wings to students\r\n                            who want to pursue a career in the aviation sector with the Aircraft Maintenance\r\n                            Engineering course. Since then, over the past decade and a half, it has endeavoured\r\n                            to give the best to its students in terms of the state-of-the-art infrastructure,\r\n                            experienced faculty, training support, well-structured curriculum as well as On Job\r\n                            Training and placement assistance to the eligible students Nationally &\r\n                            Internationally in aviation industries and extensive participation of the students\r\n                            in co-curricular activities for their overall holistic development. National approval plays a crucial role in certifying AME courses\r\n                            through a rigorous process that ensures students meet the highest standards of safety and\r\n                            competence. International certification is recognized and accepted by numerous aviation\r\n                            authorities in countries around the world Embark on an exciting journey into the world of aviation with\r\n                            the\r\n                            Aircraft Maintenance\r\n                            Engineering (AME) course. Designed for enthusiasts passionate about aircraft and their\r\n                            intricate systems, this Courses equips with the necessary skills for the maintenance and\r\n                            repair of aircraft and knowledge to ensure the safety and reliability of aircraft. The\r\n                            curriculum is comprehensive, covering both theoretical and practical aspects to ensure\r\n                            students are well-prepared for the dynamic aviation industry. Discover the pinnacle of aviation education at Thakur Institute of\r\n                    Aviation Technology ( TIAT)\r\n                    institute, offering cutting-edge Aircraft Maintenance Engineering courses that soar above the rest.\r\n                    TIAT stands as a beacon of excellence, providing students with hands-on training, state-of-the-art\r\n                    facilities, and a curriculum designed to meet the dynamic needs of the aviation industry. Join us on\r\n                    a journey to soar to new heights in your aviation career– where excellence takes flight.\" Experience the thrill of dynamic and interactive environment where theory meets reality with\r\n                            hands-on learning on our Live Aircraft include Capsule of Boeing 747-200:-Cabin, Cessna\r\n                            150M, Learjet 24, an Enstrom-280C helicopter, & JT9D7Q engine, fully equipped Turbofan\r\n                            Engine, Turbo Prop AI-20M, Cockpit and Fixed Wing, NLG, MLG of B747 system, Virtual Cockpit\r\n                            Simulator for demonstration of Practical Training Program for aspiring Aircraft Maintenance\r\n                            Engineering (AME) students. The institute has an agreement for practical training with all\r\n                            the national leading Airlines and with few renowned international MROs. TIAT organized a felicitation ceremony for successfully placed Students of Batch 0720, 0721 & their Parents. Join us in acknowledging the remarkable achievements of our\r\n                            distinguished alumni who have\r\n                            soared to great heights in the field of Aircraft Maintenance Engineering (AME). These\r\n                            trailblazers have not only completed their education with us but have also left an indelible\r\n                            mark on the aviation industry. Their stories of dedication, expertise, and resilience serve\r\n                            as beacons for aspiring professionals in AME, motivating to strive for excellence and make\r\n                            meaningful contributions to the dynamic and ever-evolving field of aviation. Thakur not only made our foundations strong, it made sure the whole building was\r\n                                    made\r\n                                    with quality. We were never forced to follow a schedule, we were given equal chances\r\n                                    to\r\n                                    be in the theory class as well as on the practicals even when not scheduled which\r\n                                    gave\r\n                                    us more exposure. I have been selected for IndiGo airlines as an associate JTO-PLM. I am thankful to\r\n                                    Thakur Institute of Aviation Technology (TIAT) for their constant support and\r\n                                    guidance.\r\n                                    Thanks TIAT for always being there for me as it wouldn’t have been possible\r\n                                    without you. Great engineers are made, not born. A man may possess good eyesight , sensitive\r\n                                    hands\r\n                                    and perfect coordination, but the end result is only fashioned by steady coaching\r\n                                    from\r\n                                    TIAT. I pursued the Avionics stream in Thakur Aviation and in a duration of three years I\r\n                                    came\r\n                                    across class apart teaching and infrastructure. The college has the best workshops\r\n                                    and\r\n                                    labs where we were exposed to real aircraft parts and materials. Thakur Institute Of Aviation Technology is 1 of the finest and DGCA Recognized AME\r\n                                    college in India. College gives us the strong foundation with respect to studies,\r\n                                    helps\r\n                                    us build ourselves with the Hi-Tech Labs & qualified and well experienced\r\n                                    Instructors. We are thrilled to announce that our institute has achieved\r\n                            remarkable success in placing our\r\n                            talented Aircraft Maintenance Engineering (AME) students in leading aviation organizations.\r\n                            Our commitment to providing quality education and industry-relevant training has resulted in\r\n                            excellent career opportunities in the aviation industry. Frequently Asked Questions (FAQ) for Aircraft Maintenance\r\n                            Engineering (AME) An Aircraft Maintenance Engineer (AME) is a highly skilled professional responsible for\r\n                                ensuring the safety and airworthiness of aircraft. AMEs perform inspections,\r\n                                maintenance, and repairs on various aircraft components, including engines, avionics,\r\n                                and structures. To become an AME, one typically needs to complete a formal training program from an\r\n                                aviation\r\n                                maintenance institute approved by aviation authorities. The training includes\r\n                                theoretical\r\n                                knowledge and hands-on experience. Thakur Institute of Aviation Technology is the best AME institute in India approved by\r\n                                DGCA, EASA,\r\n                                GCAA, BCAA and CAAB. Best education facilities with experienced and qualified\r\n                                instructors, and the\r\n                                best learning environment. Aspiring AMEs must be completed 10+2 class with (PCM) OR Diploma in\r\n                                Aeronautical,Mechanical,Electrical and Electronics recognized by State Technical\r\n                                Education Board. 10th and above No CET required. One can apply for AME 2024 through the online/offline. For online vist to know more about the\r\n                                admission process please visit institute. The salary of an AME can vary based on factors like experience, location, and the type of\r\n                                aircraft they work on. On average, AMEs enjoy competitive salaries, with the potential\r\n                                for higher earnings as they gain expertise. Job demand for AMEs is driven by the continuous growth of the aviation industry. Skilled\r\n                                AMEs are in demand globally, and the career offers stability and long-term prospects. To begin a career as an AME, enroll in an accredited training program with TIAT, gain\r\n                                practical experience through internships or apprenticeships, and obtain the necessary\r\n                                national or international certifications. Yes, TIAT provides specific scholarships for female students and merit-based scholarships\r\n                                for male students who wish to pursue a career in Aircraft Maintenance Engineering. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in achived successful job placemets through campus interview to Thakur Institute of Aviation Technology with TIAT -Where Passion and Precision Collide with State-of-the-Art Hangars and Technical Laboratories. for Real-world Impact. through Live Aircraft and a World of Aircraft Components. in 18 Years of Excellence at TIAT for the Best AME Institute in India NEWS FLASH TIAT Welcome Nurturing Aviation Careers Aviation Excellence Actual  Environmental Training Enhancing Training Soaring Together with 2300+ Students Academic Leadership Award What is an Aircraft Maintenance Engineer\r\n                                (AME)? How to become an AME? Which institute is best for AME? What qualifications are required to become an\r\n                                AME? How do I apply for AME Admission process\r\n                                2024? What is the earning potential for AME? What is job demand for AME? How can I start a career as an AME? Is there any scholarship for Aircraft Maintenance\r\n                                Engineering? × National & International Approvals Our Courses Highlights Live Aircrafts at our Campus \"Creating Futures, Winning Trust: Parents' Testimonials\" Our Successful Alumni Our Students were placed Need help? Try our FAQ's Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Directorate General\r\n                            of Civil Aviation (DGCA) European Union Aviation Safety Agency (EASA) General Civil Aviation Authority (GCAA) Airbus A320 Family Type Training Bhutan Civil Aviation Authority (BCAA) Civil Aviation Authority, Bangladesh (CAAB) Aircraft Maintenance Engineering (Approved by DGCA) Aircraft Maintenance License (Approved by EASA/GCAA/BCAA) B.Sc in Aeronautics (Approved by UGC) About TIAT Quick links Contact us Admissions Open for 2024-25 18+ years of Academic Excellence Aviation Authority Approval - National & International Professional Trained Internationally Experienced Faculties Cutting-Edge Curriculum Live Aircraft- from Cockpit to Wings Well-equipped Hangars and Technical Laboratory State-of-the-art Infrastructure & Amenities Actual Environmental Training Placements: All around the Globe Call us for more information Please fill the details B1.1\r\n                                    (Heavy Aeroplane & Turbine Engine) B1.3\r\n                                    (Helicopter & Turbine Engine) B2\r\n                                    (Avionics) B1.1\r\n                                    (Heavy Aeroplane & Turbine Engine) B2\r\n                                    (Avionics) B.Sc in Aeronautics\r\n                                    (Avionics) B.Sc in Aeronautics\r\n                                    (Mechanical) 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/contact.php", "content": "Zagdu Singh Charitable Trust’s Thakur Insititute of Aviation Technology,\r\n                            Thakur Complex, 90 Feet Road,\r\n                            Near Western Express Highway, Kandivali(E). Mumbai – 400 101 Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in Kindly mail us for further information or enquiry. tiat@thakureducation.org Mr. Subhajit Maity (Accountable Manager) – 022 28542481 Extn. 361 Mr. Vivek Kulkarni (Technical Instructor) – 022 28542481 Extn. 365 NEWS FLASH × Contact Us Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Contact Form contact info About TIAT Quick links Contact us Just call for more information Please fill the details Contact Us 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/career.php", "content": "The fast growing aviation industry has\r\n                                    always demanded the best of human perfection to keep alive the human quest to find\r\n                                    new\r\n                                    milestone in aviation. All the columns in the application should be filled. If space provided is\r\n                                    insufficient\r\n                                    you can attach additional sheets. Mention appropriate post and specialization for\r\n                                    which\r\n                                    you are applying. Salary will not be a constraint for the right candidate. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Career Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Opportunities for a Dynamic Career at TIAT About TIAT Quick links Contact us Please fill the details Career 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/amenities.php", "content": "TIAT has its own facility for conducting Theoretical\r\n                Training and Inhouse Practical Training in workshops\r\n                and Labs located in TIAT and in Hangar.The Hangar is located in TVM premises. Both the facilities are\r\n                approved and mentioned in MTOE. The fully Computerized Library is equipped with well stocked volumes of text books,\r\n                                    reference books, automated CD's & periodicals spanning the entire spectrum of\r\n                                    Aircraft Maintenance Engineering Courses. The institute has updated modern e-library facility with more than 20 PCs with LAN &\r\n                                    high-speed broadband internet connection where e-resources & e-documents can be\r\n                                    searched within a short span of time. With the help of e-library students can easily\r\n                                    obtain information about their courses & projects to enhance their knowledge. The air-conditioned Auditorium is equipped with high end projection facility, PA\r\n                                    Sound System etc. Interior atmosphere significantly enhances passive cooling and\r\n                                    ventilation that surround the auditorium and provides the audience a rejuvenating\r\n                                    feeling. This massive Hall is characterized by an eye-catching architecture. This\r\n                                    hall can accommodate more than 250 people. The indoor gymkhana, provides facilities for games like snooker, billiards table\r\n                                    tennis, carom, chess etc. carries a busy entertainment calendar enhancing many\r\n                                    social, leisure and sports activities. There is also a well-equipped section of\r\n                                    gymnasium for those interested in exercise and bodybuilding. A common room for girls is a shared space that provides a safe and secure environment\r\n                                    where girls can come together to learn, share experiences, and build relationships.\r\n                                    It is a place of support, acceptance, and empowerment for young women from all\r\n                                    backgrounds. A spacious and clean canteen managed by a professional caterer provides a varied and\r\n                                    quality food at affordable price on the self-service counters. Due care is taken to\r\n                                    maintain hygienic conditions in the canteen. An adjacent playground provides facilities for out-door games. The institute\r\n                                    encourages students to participate in various inter-college tournaments. Institute also has an indoor Coffee Café Day cafeteria. The cafeteria serves the hot\r\n                                    and cold beverages and some snacks items along with that it also have a large LCD\r\n                                    displaying the knowledge enhancing channels like Discovery. This space is mostly\r\n                                    used by the students to brainstorm their projects. The spacious student co-operative store meets the basic requirements of stationeries\r\n                                    as well as photo copy in the institute premises. A room that provides the first-aid treatment for the students and staff. Institute has limited hostel facility for students. Hostel is located near the\r\n                                    institute. Interested students can apply immediately after admissions. Hostel\r\n                                    allotment is done on the basis of student's academic credential & location. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Amenities Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Library E-Library AUDITORIUM GYMKHANA (Boys) Girls Common Room CANTEEN RECREATION GROUND CAFETERIA STUDENT CO-OPERATIVE STORE FIRST AID ROOM HOSTEL ACCOMODATION About TIAT Quick links Contact us Please fill the details Amenities 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/infrastructure.php", "content": "Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Infrastructure Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / About TIAT Quick links Contact us Please fill the details Infrastructure 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/virtual-tour.php", "content": "Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × 360 Virtual Tour Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / About TIAT Quick links Contact us Please fill the details 360 Virtual Tour 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/technical-support-staff.php", "content": "Bsc. Industrial Science AME Maintenance of Electrical &Electronic Servicing\r\n                                of Aviation Technology HSC worked as a aircraft maintenance Personnel Since\r\n                                2003, worked & maintained various aircraft & components like Boeing 747-100/200,\r\n                                Airbus-300/319, Bell-412 Helicopter, Cessna-150M/185, & taken active part in development\r\n                                of Aviation Labs & Mockup, Simulators. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Technical Support Staff Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / About TIAT Quick links Contact us Mr. Mehboob A. Ansari Mr. Tushar Roy Please fill the details Technical Support Staff 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/aet-coordinator.php", "content": "Quality Auditor & AET Co-ordinator BE (Mechanical), ME (Heat Power Engineering) 4 yrs Teaching Experience, 2 month Aviation\r\n                                experience Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Quality Auditor & AET Co-ordinator Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / About TIAT Quick links Contact us Mr. Siddharth Saindane Please fill the details Quality Auditor & AET\r\n                                        Co-ordinator 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/technical-instructors.php", "content": "DME BAMEL (HA), Mechanical Stream 20 years in Indian Air Force Degree in Mechanical Engineering, DME BAMEL (HA), BCA, PGDAMS, PGDIP, MA 20 years exp. in Indian Air force and 16 years Teaching Exp. (Aviation field) Graduate (BA), Degree Mechanical (AHQ) 20 years in Air force(Aviation field) 7 years\r\n                                Teaching Exp. B.Sc., LEE, AMIE Electronics, Dip. In Industrial\r\n                                Safety. 39 Years in Air India as AME. B.Sc., AME Paper-I, II BAMEL (IS,RN) Indamar Company Pvt. Ltd. DME (IAF), B.A 20 yrs. in Aircraft Maintenance in IAF BSc., AME License (B1) Small Aircraft, AVRO,\r\n                                B737,A320 40 Years Industrial Experience Diploma in Elect. Engineering BAMEC- ES,IS,RN\r\n                                E.I.R. License on A310-300, B747-400, I.R on B737-800V License on B777. E License on\r\n                                B747-200,300,B4 40 Years of Aviation Experience BSc., AME License 25 years in Aviation Experience AME (Avionics) 7 Months Industrial Experience Diploma Engineering in “Industrial Electronics”\r\n                                MSB, B-Tech in “Electronics Engineering” 14 yrs. Industrial Experience 9 yrs. Teaching\r\n                                Experience Auto Engineering Technician, NCTVT 17 Years Teaching and Non-Teaching Experience Pre-Engineering, BAMEL(HA/JE) 37 yrs. Aviation Experience BE Aeronautical Engg., ME Mechanical Engg. 9 yrs. Teaching Experience Electronics and Telecommunications, BAMEL in RN &\r\n                                IS 31 yrs. Aviation Experience & 7 yrs. Teaching\r\n                                Experience AME B2, BSc Degree in Aircraft Maintenance 4 years Teaching Experience, 10 months Aviation Experience AME B1.1, BE (Mechanical) 35yrs. Aviation Experience Degree in Electronics/Radio Communication Engineering, Module 3,4 40 yrs Industrial Experience, 2yrs. Teaching Experience AME B1.1 11 Months Industrial Experience, 4yrs. 10 Months\r\n                                Teaching Experience AME B2, Degree in M.Sc, RTR (C) 33yrs. Industrial Experience, 1yr. 5 Months Teaching\r\n                                Experience AME B1.1, Diploma in Mechanical Engineering 35 yrs. Industrial Experience, 2 Months Teaching\r\n                                Experience Diploma in Mech. Engg., BAMEC (HA/JE), B1 Licence\r\n                                on following Aircraft: A310(GE CF6-80C2), B-747-400 (PW 4056) B777-200LR/300ER (GE 90),\r\n                                B787-8 (GENX-1B) 35 yrs. Aviation Experience AME (Avionics) 8 yrs. Teaching Experience, 6 Months Aviation\r\n                                Experience AME (Mechanical), BAMEC (HA/JE) 13 yrs. 6 Months Aviation Experience, 1 yr. Teaching Experience AME (B2) 32 years Aviation experience,  2 years teaching experience BSc in AME (B2) 3 years 6 months Aviation experience,  1 year 2 months teaching experience AME (Mechanical), B.Sc. AME 5 years 4 months Aviation Experience BAMEC RA (B1.3), B1.1 (Except Module 11) 15 years Indian Airforce, 15 years Engg. Industry , 12 years Teaching Experience Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Technical Instructor Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / About TIAT Quick links Contact us Mr. Amogh Deshpande Mr. Vivek Kulkarni Mr. Sribhash Saha Chowdhury Mr. Debesh Chandra Das Mr. Amit Kumar Srivastava Mr. Roshan Walke Mr. Ashok Kumar Raina Mr. V D George Mr. Tapas Kumar Bhattacharya Ms. Smrutigandha Ghadi Mr. Prashant Nagvekar Mr. Kishor Zhumde Mr. Tapan Kumar Dhar Mr. Arvind Gupta Mr. Partha Sarkar Mr. Aman Vaidya Mr. Ajit Shastri Mr. Soumendra Nath Mandal Mr. Adil Mohammed Sadik Sayyed Mr. Vinod Jaitapkar Mr. Bhaskar Nikam Mr. K S Girigosavi Mr. Raman Chauhan Mr. Vishal Ombale Mr. A S Nalkar Mrs. Sanrekha Shinde Mr. Ganpati Kumar Mr. Sayaji Kamthe Please fill the details Technical Instructor 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/managers.php", "content": "Training Manager AME Paper-I, II & BAMEL (HA, AHC, LA CT, CP) Navion Aero plane, Aero Tech Quality Manager AME (ES,IS,RN), RTR(A) License, B.Sc., MBA in Operation 16 yrs. Aviation Experience Air India, Go Air, Raymond Aviation, Cochin International Aviation Services Ltd Examination Manager BE Mech, BAMEL (HA) 20 yrs in Aircraft Maintenance, 7 yrs in Aviation CAMO/Quality Division, 8 yrs. Teaching Experience Dy. Training Manager AME (Mechanical) 1year 6 Months teaching experience, 5 years 6 months\r\n                                in Line Maintenance and 1 year in Base Maintenance Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Managers Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / About TIAT Quick links Contact us Mr. Pravin Vishwakarma Mrs. Chetna Awasthi Mr. Ajay Patil Mr. Hiten Amrut Kadu Please fill the details Managers 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/placement.php", "content": "has achieved\r\n                            remarkable success in placing talented Aircraft Maintenance Engineering (AME) students\r\n                            in leading aviation organizations. Our commitment to providing quality education and\r\n                            industry-relevant training has resulted in excellent career opportunities in the aviation\r\n                            industry. Thakur Institute of Aviation Technology takes immense pride in\r\n                            announcing the successful selection of our\r\n                            students for placement in some of the renowned airlines & MRO. Some of the glimpses are\r\n                            as follow: Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Placement Placements Our Major Recruiters Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / About TIAT Quick links Contact us Please fill the details Placement 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/aet.php", "content": "The institute has set uplon itself a responsibility of providing quality comparable to international\r\n                standars & preparing students to measure up to the high expectations & standards of the aviation\r\n                industry. The institute has an agreement with all the National Leading Airlines & with few renowned\r\n                international MROs for practical Actual Environment Training. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Actual Environment Training Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Actual Environment Training About TIAT Quick links Contact us First time in India our EASA students are undergoing \"Specialised &\r\n                Advance Industrial Training on\r\n                Propulsive Technology\" at Pratt & Whitney (P&W) Training centre, Hyderabad. Please fill the details Actual Environment Training 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/Scholarship.php", "content": "Embarking on a journey into the world of aviation requires not only passion and dedication but also financial support. At Thakur Institute of Aviation Technology, We believe in investing in the future of aviation by supporting talented individuals who aspire to contribute to this dynamic industry. We hope to witness a future where the sky is no longer a limit, but a canvas for limitless possibilities. Together, let's take your dreams to new heights with the wings of education and sponsorship. Interested students can apply for sponsorship by submitting a comprehensive application that outlines their academic achievements, extracurricular activities, and a personal statement expressing their passion for aviation. Merit-based sponsorships will be awarded based on a competitive selection process. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Scholarship Scholarship Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Scholarship About TIAT Quick links Contact us How to Apply? Please fill the details Scholarship 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/admission-process.php", "content": "Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Admission Procedure Admission Procedure Online Admission Form Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Admission Procedure Existing Students (National & International) New Registration (International) New Registration (National) About TIAT Quick links Contact us Please fill the details Admission Procedure Applications for admission are made available in the prescribed form along\r\n                    with the\r\n                    prospectus at the institute. Eligible candidates seeking admission to AME course should submit their\r\n                    application\r\n                    form completed in all respect, together with necessary documents, to the\r\n                    institute’s office as per the schedule issued by institute, which will\r\n                    be\r\n                    displayed on the institute’s notice board. Foreign nationals & NRI candidates seeking admission to the course\r\n                    should submit\r\n                    the necessary security clearance document from Ministry of Home Affairs,\r\n                    Govt. of\r\n                    India through DGCA. Any application, which is incomplete or not accompanied by the prescribed\r\n                    documents,\r\n                    will be liable for rejection. 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/admission-process.php", "content": "Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Admission Procedure Admission Procedure Online Admission Form Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Admission Procedure Existing Students (National & International) New Registration (International) New Registration (National) About TIAT Quick links Contact us Please fill the details Admission Procedure Applications for admission are made available in the prescribed form along\r\n                    with the\r\n                    prospectus at the institute. Eligible candidates seeking admission to AME course should submit their\r\n                    application\r\n                    form completed in all respect, together with necessary documents, to the\r\n                    institute’s office as per the schedule issued by institute, which will\r\n                    be\r\n                    displayed on the institute’s notice board. Foreign nationals & NRI candidates seeking admission to the course\r\n                    should submit\r\n                    the necessary security clearance document from Ministry of Home Affairs,\r\n                    Govt. of\r\n                    India through DGCA. Any application, which is incomplete or not accompanied by the prescribed\r\n                    documents,\r\n                    will be liable for rejection. 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/AircraftTypeTraining.php", "content": "Thakur Institute of Aviation Technology (TIAT), Mumbai, established in 2006, has aligned itself with the vision and aspires to produce an increasing number of Aircraft Maintenance Engineers. Thakur Institute of Aviation Technology (TIAT) is India's first Maintenance Training Organization approved to provide Aircraft Type Training from an International Authority (EASA) approval for A 320 family with CEO and NEO engine type training. TIAT is the first Maintenance Training Organization in India approved to provide Type Training courses which is approved by EASA in the Theoretical Training Part (Excluding the examination) conducted by using DSL (Distance Learning) Virtual Classroom equipment from an A320 Type Training classroom. ONLINE DSL TRAINING (A320) CFM LEAP-1A diffrences course (B1+B2). EASA DATE: 08/03/2024 - 11/03/2024 | DSL(Online) Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Aircraft Type Training Course Details Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / About TIAT Quick links Contact us Call us for more information Please fill the details Aircraft Type Training 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/BSC-Aeronautics.php", "content": "TIAT under the flag of Thakur Shyamnarayan Degree College received approval to conduct B.Sc.\r\n                            Aeronautics courses in Mumbai (Mechanical and Avionics) in Affiliation with Mumbai\r\n                            University. It is an interdisciplinary skill that involves courses based on related sciences\r\n                            and designing as per with AME/AML Syllabus. A Bachelor of Science (BSc) in Aeronautical includes a wide range of topics related to the\r\n                            design, development, and maintenance of aircraft and aerospace systems. The program is\r\n                            divided into two specializations: Mechanical and Avionics. TIAT is the first basic maintenance training organization in India having a full-fledged\r\n                            AR/VR lab wherein the students can comprehend the Aircraft system and components\r\n                            realistically. The institute has an agreement with all the national leading Airlines and\r\n                            with a few renowned international MROs for practical training. HSC (10+2) with minimum 45% marks in aggregate with English, Physics and mathematics\r\n                            subjects or Diploma (10+3) awarded by MSBTE or equivalent by any other Government body. HSC (10+2) with minimum 45% marks in aggregate with English, Physics, and mathematics\r\n                            subjects or Diploma (10+3) awarded by MSBTE or equivalent by any other Government body. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × B.Sc Aeronautics Engineering Course details Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Course Syllabus (Mumbai University) Semester-wise Course details (Avionics) Semester-wise Course details (Mechanical) Eligibility Criteria Admission Procedure Document Submission Terms & Condition for the Students About TIAT Quick links Contact us B.Sc. Aeronautics in Mumbai (Avionics) B.Sc. Aeronautics in Mumbai (Mechanical) Please fill the details B.Sc Aeronautics Engg.\r\n                                        (Avionics/Mechanical) Applications for admission are made available in the prescribed form along with the\r\n                                prospectus at the institute. Eligible candidates seeking admission to AML course should submit their application\r\n                                form complete in all respect, together with necessary documents, to the institute's\r\n                                office as per the schedule issued by institute. Any application, which is incomplete or not accompanied by the prescribed documents,\r\n                                will be liable for rejection. \"Letter of Admission\" will be issued after the selection by scrutiny of the necessary\r\n                                documents & payment of fees in full. Foreign nationals & NRI candidates seeking admission to the course should submit their\r\n                                photocopies of passport, qualification certificates. Attested copy of Statement of marks of SSC or Equivalent Certificates.\r\n                                (Original to be submitted at the time of admission) Attested copy of Leaving Certificate issued by the School/ College, if applicable.\r\n                                (Original to be submitted at the time of admission) Attested copy of Transfer Certificate from the last attended institute, if applicable.\r\n                                (Original to be submitted at the time of admission) 10 Passport size colour Photograph duly signed on back by the candidate. Attested copy of Passport. During the admission process, I have been explained the disciplinary rules\r\n                                of the Institution and I have understood the same. I was also made aware of the\r\n                                Code of\r\n                                Conduct, Academic Rules, attendance, Examination Rules, Uniform and Library\r\n                                Policy\r\n                                of the Institute and I have understood the same. I as parent/s hereby undertake to diligently pay all Institute fees on time. I will attend all the classes from the re-opening day of the Institute on\r\n                                ………….or as per the timetable, failing which I am\r\n                                liable\r\n                                to pay a fine at the rate of Rs.100/- per day for the first one week. In\r\n                                case, I do\r\n                                not turn up even after one week of starting of classes, I shall be\r\n                                ineligible to\r\n                                continue for the current academic year. I will be regular and punctual to all the classes (theory/practical/drawing)\r\n                                and\r\n                                secure attendance of not less than 90% in each subject as stipulated by\r\n                                Institute. I will compulsorily follow the uniform prescribed by the Institute. I will conduct myself in a highly disciplined and decent manner both inside\r\n                                the\r\n                                classroom and in the campus, failing which suitable action may be taken\r\n                                against me\r\n                                as per the rules and regulations of the Institute. I will concentrate on my studies without wasting time in the\r\n                                Campus/Hostel/Residence\r\n                                and attend all the tests to secure more than the minimum prescribed Class /\r\n                                Sessional Marks in each subject. I will submit the assignments given in time\r\n                                to\r\n                                improve my performance. I will not use Mobile Phone to the Institute campus and also, I will not\r\n                                involve in\r\n                                any form of ragging inside or outside the campus. I am fully aware that\r\n                                bringing\r\n                                mobile phone to the campus and involving in Ragging activities is an offence\r\n                                and\r\n                                punishable as per Institute rules/Law. I will pay tuition fees, examination fees and any other dues within the\r\n                                stipulated\r\n                                time as required by the Institute authorities failing which I may not be\r\n                                permitted\r\n                                to attend the classes. I will not cause or involve in any sort of violence or disturbance both\r\n                                within and\r\n                                outside the Institute campus. If I become absent continuously for 3 days, my parents will have to meet the\r\n                                concerned Training Manager/Dy. Training Manager. Action against ragging: Maharashtra Prohibition of Ragging Act 1999 which is\r\n                                in\r\n                                effect from 15th May 1999 has the following provisions for Action against\r\n                                Ragging. Ragging within or outside of any educational institution is\r\n                                        prohibited, Whosoever directly or indirectly commits, participates in, abets, or\r\n                                        propagates ragging within or outside any Educational institution\r\n                                        shall, on\r\n                                        conviction, be punished with imprisonment for a term up to 2 years\r\n                                        and / or\r\n                                        penalty as per Ragging Act 1999. Any student convicted of an offence of ragging shall be dismissed\r\n                                        from the\r\n                                        educational institution and such student shall not be admitted in\r\n                                        any other\r\n                                        educational institution for a period of five years from the date of\r\n                                        order of\r\n                                        such dismissal. 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/index.php", "content": "is a highly respected\r\n                            education brand established in March 2006 with a motive to provide wings to students\r\n                            who want to pursue a career in the aviation sector with the Aircraft Maintenance\r\n                            Engineering course. Since then, over the past decade and a half, it has endeavoured\r\n                            to give the best to its students in terms of the state-of-the-art infrastructure,\r\n                            experienced faculty, training support, well-structured curriculum as well as On Job\r\n                            Training and placement assistance to the eligible students Nationally &\r\n                            Internationally in aviation industries and extensive participation of the students\r\n                            in co-curricular activities for their overall holistic development. National approval plays a crucial role in certifying AME courses\r\n                            through a rigorous process that ensures students meet the highest standards of safety and\r\n                            competence. International certification is recognized and accepted by numerous aviation\r\n                            authorities in countries around the world Embark on an exciting journey into the world of aviation with\r\n                            the\r\n                            Aircraft Maintenance\r\n                            Engineering (AME) course. Designed for enthusiasts passionate about aircraft and their\r\n                            intricate systems, this Courses equips with the necessary skills for the maintenance and\r\n                            repair of aircraft and knowledge to ensure the safety and reliability of aircraft. The\r\n                            curriculum is comprehensive, covering both theoretical and practical aspects to ensure\r\n                            students are well-prepared for the dynamic aviation industry. Discover the pinnacle of aviation education at Thakur Institute of\r\n                    Aviation Technology ( TIAT)\r\n                    institute, offering cutting-edge Aircraft Maintenance Engineering courses that soar above the rest.\r\n                    TIAT stands as a beacon of excellence, providing students with hands-on training, state-of-the-art\r\n                    facilities, and a curriculum designed to meet the dynamic needs of the aviation industry. Join us on\r\n                    a journey to soar to new heights in your aviation career– where excellence takes flight.\" Experience the thrill of dynamic and interactive environment where theory meets reality with\r\n                            hands-on learning on our Live Aircraft include Capsule of Boeing 747-200:-Cabin, Cessna\r\n                            150M, Learjet 24, an Enstrom-280C helicopter, & JT9D7Q engine, fully equipped Turbofan\r\n                            Engine, Turbo Prop AI-20M, Cockpit and Fixed Wing, NLG, MLG of B747 system, Virtual Cockpit\r\n                            Simulator for demonstration of Practical Training Program for aspiring Aircraft Maintenance\r\n                            Engineering (AME) students. The institute has an agreement for practical training with all\r\n                            the national leading Airlines and with few renowned international MROs. TIAT organized a felicitation ceremony for successfully placed Students of Batch 0720, 0721 & their Parents. Join us in acknowledging the remarkable achievements of our\r\n                            distinguished alumni who have\r\n                            soared to great heights in the field of Aircraft Maintenance Engineering (AME). These\r\n                            trailblazers have not only completed their education with us but have also left an indelible\r\n                            mark on the aviation industry. Their stories of dedication, expertise, and resilience serve\r\n                            as beacons for aspiring professionals in AME, motivating to strive for excellence and make\r\n                            meaningful contributions to the dynamic and ever-evolving field of aviation. Thakur not only made our foundations strong, it made sure the whole building was\r\n                                    made\r\n                                    with quality. We were never forced to follow a schedule, we were given equal chances\r\n                                    to\r\n                                    be in the theory class as well as on the practicals even when not scheduled which\r\n                                    gave\r\n                                    us more exposure. I have been selected for IndiGo airlines as an associate JTO-PLM. I am thankful to\r\n                                    Thakur Institute of Aviation Technology (TIAT) for their constant support and\r\n                                    guidance.\r\n                                    Thanks TIAT for always being there for me as it wouldn’t have been possible\r\n                                    without you. Great engineers are made, not born. A man may possess good eyesight , sensitive\r\n                                    hands\r\n                                    and perfect coordination, but the end result is only fashioned by steady coaching\r\n                                    from\r\n                                    TIAT. I pursued the Avionics stream in Thakur Aviation and in a duration of three years I\r\n                                    came\r\n                                    across class apart teaching and infrastructure. The college has the best workshops\r\n                                    and\r\n                                    labs where we were exposed to real aircraft parts and materials. Thakur Institute Of Aviation Technology is 1 of the finest and DGCA Recognized AME\r\n                                    college in India. College gives us the strong foundation with respect to studies,\r\n                                    helps\r\n                                    us build ourselves with the Hi-Tech Labs & qualified and well experienced\r\n                                    Instructors. We are thrilled to announce that our institute has achieved\r\n                            remarkable success in placing our\r\n                            talented Aircraft Maintenance Engineering (AME) students in leading aviation organizations.\r\n                            Our commitment to providing quality education and industry-relevant training has resulted in\r\n                            excellent career opportunities in the aviation industry. Frequently Asked Questions (FAQ) for Aircraft Maintenance\r\n                            Engineering (AME) An Aircraft Maintenance Engineer (AME) is a highly skilled professional responsible for\r\n                                ensuring the safety and airworthiness of aircraft. AMEs perform inspections,\r\n                                maintenance, and repairs on various aircraft components, including engines, avionics,\r\n                                and structures. To become an AME, one typically needs to complete a formal training program from an\r\n                                aviation\r\n                                maintenance institute approved by aviation authorities. The training includes\r\n                                theoretical\r\n                                knowledge and hands-on experience. Thakur Institute of Aviation Technology is the best AME institute in India approved by\r\n                                DGCA, EASA,\r\n                                GCAA, BCAA and CAAB. Best education facilities with experienced and qualified\r\n                                instructors, and the\r\n                                best learning environment. Aspiring AMEs must be completed 10+2 class with (PCM) OR Diploma in\r\n                                Aeronautical,Mechanical,Electrical and Electronics recognized by State Technical\r\n                                Education Board. 10th and above No CET required. One can apply for AME 2024 through the online/offline. For online vist to know more about the\r\n                                admission process please visit institute. The salary of an AME can vary based on factors like experience, location, and the type of\r\n                                aircraft they work on. On average, AMEs enjoy competitive salaries, with the potential\r\n                                for higher earnings as they gain expertise. Job demand for AMEs is driven by the continuous growth of the aviation industry. Skilled\r\n                                AMEs are in demand globally, and the career offers stability and long-term prospects. To begin a career as an AME, enroll in an accredited training program with TIAT, gain\r\n                                practical experience through internships or apprenticeships, and obtain the necessary\r\n                                national or international certifications. Yes, TIAT provides specific scholarships for female students and merit-based scholarships\r\n                                for male students who wish to pursue a career in Aircraft Maintenance Engineering. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in achived successful job placemets through campus interview to Thakur Institute of Aviation Technology with TIAT -Where Passion and Precision Collide with State-of-the-Art Hangars and Technical Laboratories. for Real-world Impact. through Live Aircraft and a World of Aircraft Components. in 18 Years of Excellence at TIAT for the Best AME Institute in India NEWS FLASH TIAT Welcome Nurturing Aviation Careers Aviation Excellence Actual  Environmental Training Enhancing Training Soaring Together with 2300+ Students Academic Leadership Award What is an Aircraft Maintenance Engineer\r\n                                (AME)? How to become an AME? Which institute is best for AME? What qualifications are required to become an\r\n                                AME? How do I apply for AME Admission process\r\n                                2024? What is the earning potential for AME? What is job demand for AME? How can I start a career as an AME? Is there any scholarship for Aircraft Maintenance\r\n                                Engineering? × National & International Approvals Our Courses Highlights Live Aircrafts at our Campus \"Creating Futures, Winning Trust: Parents' Testimonials\" Our Successful Alumni Our Students were placed Need help? Try our FAQ's Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Directorate General\r\n                            of Civil Aviation (DGCA) European Union Aviation Safety Agency (EASA) General Civil Aviation Authority (GCAA) Airbus A320 Family Type Training Bhutan Civil Aviation Authority (BCAA) Civil Aviation Authority, Bangladesh (CAAB) Aircraft Maintenance Engineering (Approved by DGCA) Aircraft Maintenance License (Approved by EASA/GCAA/BCAA) B.Sc in Aeronautics (Approved by UGC) About TIAT Quick links Contact us Admissions Open for 2024-25 18+ years of Academic Excellence Aviation Authority Approval - National & International Professional Trained Internationally Experienced Faculties Cutting-Edge Curriculum Live Aircraft- from Cockpit to Wings Well-equipped Hangars and Technical Laboratory State-of-the-art Infrastructure & Amenities Actual Environmental Training Placements: All around the Globe Call us for more information Please fill the details B1.1\r\n                                    (Heavy Aeroplane & Turbine Engine) B1.3\r\n                                    (Helicopter & Turbine Engine) B2\r\n                                    (Avionics) B1.1\r\n                                    (Heavy Aeroplane & Turbine Engine) B2\r\n                                    (Avionics) B.Sc in Aeronautics\r\n                                    (Avionics) B.Sc in Aeronautics\r\n                                    (Mechanical) 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/contact.php", "content": "Zagdu Singh Charitable Trust’s Thakur Insititute of Aviation Technology,\r\n                            Thakur Complex, 90 Feet Road,\r\n                            Near Western Express Highway, Kandivali(E). Mumbai – 400 101 Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in Kindly mail us for further information or enquiry. tiat@thakureducation.org Mr. Subhajit Maity (Accountable Manager) – 022 28542481 Extn. 361 Mr. Vivek Kulkarni (Technical Instructor) – 022 28542481 Extn. 365 NEWS FLASH × Contact Us Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Contact Form contact info About TIAT Quick links Contact us Just call for more information Please fill the details Contact Us 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/career.php", "content": "The fast growing aviation industry has\r\n                                    always demanded the best of human perfection to keep alive the human quest to find\r\n                                    new\r\n                                    milestone in aviation. All the columns in the application should be filled. If space provided is\r\n                                    insufficient\r\n                                    you can attach additional sheets. Mention appropriate post and specialization for\r\n                                    which\r\n                                    you are applying. Salary will not be a constraint for the right candidate. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Career Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Opportunities for a Dynamic Career at TIAT About TIAT Quick links Contact us Please fill the details Career 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/amenities.php", "content": "TIAT has its own facility for conducting Theoretical\r\n                Training and Inhouse Practical Training in workshops\r\n                and Labs located in TIAT and in Hangar.The Hangar is located in TVM premises. Both the facilities are\r\n                approved and mentioned in MTOE. The fully Computerized Library is equipped with well stocked volumes of text books,\r\n                                    reference books, automated CD's & periodicals spanning the entire spectrum of\r\n                                    Aircraft Maintenance Engineering Courses. The institute has updated modern e-library facility with more than 20 PCs with LAN &\r\n                                    high-speed broadband internet connection where e-resources & e-documents can be\r\n                                    searched within a short span of time. With the help of e-library students can easily\r\n                                    obtain information about their courses & projects to enhance their knowledge. The air-conditioned Auditorium is equipped with high end projection facility, PA\r\n                                    Sound System etc. Interior atmosphere significantly enhances passive cooling and\r\n                                    ventilation that surround the auditorium and provides the audience a rejuvenating\r\n                                    feeling. This massive Hall is characterized by an eye-catching architecture. This\r\n                                    hall can accommodate more than 250 people. The indoor gymkhana, provides facilities for games like snooker, billiards table\r\n                                    tennis, carom, chess etc. carries a busy entertainment calendar enhancing many\r\n                                    social, leisure and sports activities. There is also a well-equipped section of\r\n                                    gymnasium for those interested in exercise and bodybuilding. A common room for girls is a shared space that provides a safe and secure environment\r\n                                    where girls can come together to learn, share experiences, and build relationships.\r\n                                    It is a place of support, acceptance, and empowerment for young women from all\r\n                                    backgrounds. A spacious and clean canteen managed by a professional caterer provides a varied and\r\n                                    quality food at affordable price on the self-service counters. Due care is taken to\r\n                                    maintain hygienic conditions in the canteen. An adjacent playground provides facilities for out-door games. The institute\r\n                                    encourages students to participate in various inter-college tournaments. Institute also has an indoor Coffee Café Day cafeteria. The cafeteria serves the hot\r\n                                    and cold beverages and some snacks items along with that it also have a large LCD\r\n                                    displaying the knowledge enhancing channels like Discovery. This space is mostly\r\n                                    used by the students to brainstorm their projects. The spacious student co-operative store meets the basic requirements of stationeries\r\n                                    as well as photo copy in the institute premises. A room that provides the first-aid treatment for the students and staff. Institute has limited hostel facility for students. Hostel is located near the\r\n                                    institute. Interested students can apply immediately after admissions. Hostel\r\n                                    allotment is done on the basis of student's academic credential & location. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Amenities Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Library E-Library AUDITORIUM GYMKHANA (Boys) Girls Common Room CANTEEN RECREATION GROUND CAFETERIA STUDENT CO-OPERATIVE STORE FIRST AID ROOM HOSTEL ACCOMODATION About TIAT Quick links Contact us Please fill the details Amenities 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/infrastructure.php", "content": "Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Infrastructure Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / About TIAT Quick links Contact us Please fill the details Infrastructure 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/virtual-tour.php", "content": "Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × 360 Virtual Tour Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / About TIAT Quick links Contact us Please fill the details 360 Virtual Tour 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/technical-support-staff.php", "content": "Bsc. Industrial Science AME Maintenance of Electrical &Electronic Servicing\r\n                                of Aviation Technology HSC worked as a aircraft maintenance Personnel Since\r\n                                2003, worked & maintained various aircraft & components like Boeing 747-100/200,\r\n                                Airbus-300/319, Bell-412 Helicopter, Cessna-150M/185, & taken active part in development\r\n                                of Aviation Labs & Mockup, Simulators. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Technical Support Staff Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / About TIAT Quick links Contact us Mr. Mehboob A. Ansari Mr. Tushar Roy Please fill the details Technical Support Staff 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/aet-coordinator.php", "content": "Quality Auditor & AET Co-ordinator BE (Mechanical), ME (Heat Power Engineering) 4 yrs Teaching Experience, 2 month Aviation\r\n                                experience Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Quality Auditor & AET Co-ordinator Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / About TIAT Quick links Contact us Mr. Siddharth Saindane Please fill the details Quality Auditor & AET\r\n                                        Co-ordinator 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/technical-instructors.php", "content": "DME BAMEL (HA), Mechanical Stream 20 years in Indian Air Force Degree in Mechanical Engineering, DME BAMEL (HA), BCA, PGDAMS, PGDIP, MA 20 years exp. in Indian Air force and 16 years Teaching Exp. (Aviation field) Graduate (BA), Degree Mechanical (AHQ) 20 years in Air force(Aviation field) 7 years\r\n                                Teaching Exp. B.Sc., LEE, AMIE Electronics, Dip. In Industrial\r\n                                Safety. 39 Years in Air India as AME. B.Sc., AME Paper-I, II BAMEL (IS,RN) Indamar Company Pvt. Ltd. DME (IAF), B.A 20 yrs. in Aircraft Maintenance in IAF BSc., AME License (B1) Small Aircraft, AVRO,\r\n                                B737,A320 40 Years Industrial Experience Diploma in Elect. Engineering BAMEC- ES,IS,RN\r\n                                E.I.R. License on A310-300, B747-400, I.R on B737-800V License on B777. E License on\r\n                                B747-200,300,B4 40 Years of Aviation Experience BSc., AME License 25 years in Aviation Experience AME (Avionics) 7 Months Industrial Experience Diploma Engineering in “Industrial Electronics”\r\n                                MSB, B-Tech in “Electronics Engineering” 14 yrs. Industrial Experience 9 yrs. Teaching\r\n                                Experience Auto Engineering Technician, NCTVT 17 Years Teaching and Non-Teaching Experience Pre-Engineering, BAMEL(HA/JE) 37 yrs. Aviation Experience BE Aeronautical Engg., ME Mechanical Engg. 9 yrs. Teaching Experience Electronics and Telecommunications, BAMEL in RN &\r\n                                IS 31 yrs. Aviation Experience & 7 yrs. Teaching\r\n                                Experience AME B2, BSc Degree in Aircraft Maintenance 4 years Teaching Experience, 10 months Aviation Experience AME B1.1, BE (Mechanical) 35yrs. Aviation Experience Degree in Electronics/Radio Communication Engineering, Module 3,4 40 yrs Industrial Experience, 2yrs. Teaching Experience AME B1.1 11 Months Industrial Experience, 4yrs. 10 Months\r\n                                Teaching Experience AME B2, Degree in M.Sc, RTR (C) 33yrs. Industrial Experience, 1yr. 5 Months Teaching\r\n                                Experience AME B1.1, Diploma in Mechanical Engineering 35 yrs. Industrial Experience, 2 Months Teaching\r\n                                Experience Diploma in Mech. Engg., BAMEC (HA/JE), B1 Licence\r\n                                on following Aircraft: A310(GE CF6-80C2), B-747-400 (PW 4056) B777-200LR/300ER (GE 90),\r\n                                B787-8 (GENX-1B) 35 yrs. Aviation Experience AME (Avionics) 8 yrs. Teaching Experience, 6 Months Aviation\r\n                                Experience AME (Mechanical), BAMEC (HA/JE) 13 yrs. 6 Months Aviation Experience, 1 yr. Teaching Experience AME (B2) 32 years Aviation experience,  2 years teaching experience BSc in AME (B2) 3 years 6 months Aviation experience,  1 year 2 months teaching experience AME (Mechanical), B.Sc. AME 5 years 4 months Aviation Experience BAMEC RA (B1.3), B1.1 (Except Module 11) 15 years Indian Airforce, 15 years Engg. Industry , 12 years Teaching Experience Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Technical Instructor Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / About TIAT Quick links Contact us Mr. Amogh Deshpande Mr. Vivek Kulkarni Mr. Sribhash Saha Chowdhury Mr. Debesh Chandra Das Mr. Amit Kumar Srivastava Mr. Roshan Walke Mr. Ashok Kumar Raina Mr. V D George Mr. Tapas Kumar Bhattacharya Ms. Smrutigandha Ghadi Mr. Prashant Nagvekar Mr. Kishor Zhumde Mr. Tapan Kumar Dhar Mr. Arvind Gupta Mr. Partha Sarkar Mr. Aman Vaidya Mr. Ajit Shastri Mr. Soumendra Nath Mandal Mr. Adil Mohammed Sadik Sayyed Mr. Vinod Jaitapkar Mr. Bhaskar Nikam Mr. K S Girigosavi Mr. Raman Chauhan Mr. Vishal Ombale Mr. A S Nalkar Mrs. Sanrekha Shinde Mr. Ganpati Kumar Mr. Sayaji Kamthe Please fill the details Technical Instructor 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/managers.php", "content": "Training Manager AME Paper-I, II & BAMEL (HA, AHC, LA CT, CP) Navion Aero plane, Aero Tech Quality Manager AME (ES,IS,RN), RTR(A) License, B.Sc., MBA in Operation 16 yrs. Aviation Experience Air India, Go Air, Raymond Aviation, Cochin International Aviation Services Ltd Examination Manager BE Mech, BAMEL (HA) 20 yrs in Aircraft Maintenance, 7 yrs in Aviation CAMO/Quality Division, 8 yrs. Teaching Experience Dy. Training Manager AME (Mechanical) 1year 6 Months teaching experience, 5 years 6 months\r\n                                in Line Maintenance and 1 year in Base Maintenance Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Managers Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / About TIAT Quick links Contact us Mr. Pravin Vishwakarma Mrs. Chetna Awasthi Mr. Ajay Patil Mr. Hiten Amrut Kadu Please fill the details Managers 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/placement.php", "content": "has achieved\r\n                            remarkable success in placing talented Aircraft Maintenance Engineering (AME) students\r\n                            in leading aviation organizations. Our commitment to providing quality education and\r\n                            industry-relevant training has resulted in excellent career opportunities in the aviation\r\n                            industry. Thakur Institute of Aviation Technology takes immense pride in\r\n                            announcing the successful selection of our\r\n                            students for placement in some of the renowned airlines & MRO. Some of the glimpses are\r\n                            as follow: Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Placement Placements Our Major Recruiters Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / About TIAT Quick links Contact us Please fill the details Placement 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/aet.php", "content": "The institute has set uplon itself a responsibility of providing quality comparable to international\r\n                standars & preparing students to measure up to the high expectations & standards of the aviation\r\n                industry. The institute has an agreement with all the National Leading Airlines & with few renowned\r\n                international MROs for practical Actual Environment Training. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Actual Environment Training Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Actual Environment Training About TIAT Quick links Contact us First time in India our EASA students are undergoing \"Specialised &\r\n                Advance Industrial Training on\r\n                Propulsive Technology\" at Pratt & Whitney (P&W) Training centre, Hyderabad. Please fill the details Actual Environment Training 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/Scholarship.php", "content": "Embarking on a journey into the world of aviation requires not only passion and dedication but also financial support. At Thakur Institute of Aviation Technology, We believe in investing in the future of aviation by supporting talented individuals who aspire to contribute to this dynamic industry. We hope to witness a future where the sky is no longer a limit, but a canvas for limitless possibilities. Together, let's take your dreams to new heights with the wings of education and sponsorship. Interested students can apply for sponsorship by submitting a comprehensive application that outlines their academic achievements, extracurricular activities, and a personal statement expressing their passion for aviation. Merit-based sponsorships will be awarded based on a competitive selection process. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Scholarship Scholarship Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Scholarship About TIAT Quick links Contact us How to Apply? Please fill the details Scholarship 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/admission-process.php", "content": "Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Admission Procedure Admission Procedure Online Admission Form Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Admission Procedure Existing Students (National & International) New Registration (International) New Registration (National) About TIAT Quick links Contact us Please fill the details Admission Procedure Applications for admission are made available in the prescribed form along\r\n                    with the\r\n                    prospectus at the institute. Eligible candidates seeking admission to AME course should submit their\r\n                    application\r\n                    form completed in all respect, together with necessary documents, to the\r\n                    institute’s office as per the schedule issued by institute, which will\r\n                    be\r\n                    displayed on the institute’s notice board. Foreign nationals & NRI candidates seeking admission to the course\r\n                    should submit\r\n                    the necessary security clearance document from Ministry of Home Affairs,\r\n                    Govt. of\r\n                    India through DGCA. Any application, which is incomplete or not accompanied by the prescribed\r\n                    documents,\r\n                    will be liable for rejection. 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/admission-enquiry.php", "content": "Zagdu Singh Charitable Trust’s Thakur Insititute of Aviation Technology,\r\n              Thakur Complex, 90 Feet Road,\r\n              Near Western Express Highway, Kandivali(E). Mumbai – 400 101 Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in Kindly mail us for further information or enquiry. tiat@thakureducation.org Mr. Subhajit Maity (Accountable Manager) – 022 28542481 Extn. 361 Mr. Vivek Kulkarni (Technical Instructor) – 022 28542481 Extn. 365 NEWS FLASH × Admission Enquiry Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Admission Enquiry Form contact info About TIAT Quick links Contact us Just call for more information Please fill the details Admission Enquiry 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/AircraftTypeTraining.php", "content": "Thakur Institute of Aviation Technology (TIAT), Mumbai, established in 2006, has aligned itself with the vision and aspires to produce an increasing number of Aircraft Maintenance Engineers. Thakur Institute of Aviation Technology (TIAT) is India's first Maintenance Training Organization approved to provide Aircraft Type Training from an International Authority (EASA) approval for A 320 family with CEO and NEO engine type training. TIAT is the first Maintenance Training Organization in India approved to provide Type Training courses which is approved by EASA in the Theoretical Training Part (Excluding the examination) conducted by using DSL (Distance Learning) Virtual Classroom equipment from an A320 Type Training classroom. ONLINE DSL TRAINING (A320) CFM LEAP-1A diffrences course (B1+B2). EASA DATE: 08/03/2024 - 11/03/2024 | DSL(Online) Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Aircraft Type Training Course Details Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / About TIAT Quick links Contact us Call us for more information Please fill the details Aircraft Type Training 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/syllabus-mechanical.php", "content": "Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × B.Sc. Aeronautics (Mechanical) Syllabus Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / First Year Second Year Third Year About TIAT Quick links Contact us Please fill the details B.Sc. Aeronautics\r\n                                        (Mechanical) 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory SR.No. Semester - I Semester - II SR.No. Semester - III Semester - IV SR.No. Semester - V Semester - VI 1 Basic Aerodynamics Electrical Fundamentals - II 2 Workshop Technology Electronic Fundamentals 3 Electrical Fundamentals - I Maintenance practices - I 4 Engineering Drawing Aircraft Structure 5 Human factors / Communication Skill Environmental Studies 6 Basic Aerodynamics & Workshop Technology\r\n                                        (Practical) Aircraft Structure & maintenance\r\n                                        practices 7 Electrical Fundamentals - I\r\n                                        (Practical) 8 Engineering Drawing - I (Practical) 1 Maintenance Practices - II Aviation Legislation - II 2 Aviation Legislation - I Aircraft Fuel and Fuel System 3 Digital & Computer Techniques Aircraft hydraulic & Oxygen\r\n                                        System 4 Aircraft Materials Hydraulic & Oxygen System 5 Theory of Flight & Flight Controls Piston Engine & Systems 6 Aircraft Materials & Maintenance\r\n                                        Practices II Piston Engine & Aircraft Fuel\r\n                                        System Propeller 1 landing Gear, Wheels & Brakes Gas Turbine Engine - II 2 Cabin Atmosphere Control Ground Handling & Documentation 3 Gas Turbine Engine - II Airframe Snag Analysis &\r\n                                                Rectification 4 Airframe Structure - II Engine Snag Analysis &\r\n                                                Rectification 5 Aircraft Structure - II Airframe & Engine Snag Analysis &\r\n                                                Rectification 6 Landing Gear Innovative Project on Airframe System or\r\n                                                Engine System 7 Cabin Atmosphere Control & Aircraft\r\n                                                Structure - II"}
{"url": "https://tiatmumbai.in/index.php", "content": "is a highly respected\r\n                            education brand established in March 2006 with a motive to provide wings to students\r\n                            who want to pursue a career in the aviation sector with the Aircraft Maintenance\r\n                            Engineering course. Since then, over the past decade and a half, it has endeavoured\r\n                            to give the best to its students in terms of the state-of-the-art infrastructure,\r\n                            experienced faculty, training support, well-structured curriculum as well as On Job\r\n                            Training and placement assistance to the eligible students Nationally &\r\n                            Internationally in aviation industries and extensive participation of the students\r\n                            in co-curricular activities for their overall holistic development. National approval plays a crucial role in certifying AME courses\r\n                            through a rigorous process that ensures students meet the highest standards of safety and\r\n                            competence. International certification is recognized and accepted by numerous aviation\r\n                            authorities in countries around the world Embark on an exciting journey into the world of aviation with\r\n                            the\r\n                            Aircraft Maintenance\r\n                            Engineering (AME) course. Designed for enthusiasts passionate about aircraft and their\r\n                            intricate systems, this Courses equips with the necessary skills for the maintenance and\r\n                            repair of aircraft and knowledge to ensure the safety and reliability of aircraft. The\r\n                            curriculum is comprehensive, covering both theoretical and practical aspects to ensure\r\n                            students are well-prepared for the dynamic aviation industry. Discover the pinnacle of aviation education at Thakur Institute of\r\n                    Aviation Technology ( TIAT)\r\n                    institute, offering cutting-edge Aircraft Maintenance Engineering courses that soar above the rest.\r\n                    TIAT stands as a beacon of excellence, providing students with hands-on training, state-of-the-art\r\n                    facilities, and a curriculum designed to meet the dynamic needs of the aviation industry. Join us on\r\n                    a journey to soar to new heights in your aviation career– where excellence takes flight.\" Experience the thrill of dynamic and interactive environment where theory meets reality with\r\n                            hands-on learning on our Live Aircraft include Capsule of Boeing 747-200:-Cabin, Cessna\r\n                            150M, Learjet 24, an Enstrom-280C helicopter, & JT9D7Q engine, fully equipped Turbofan\r\n                            Engine, Turbo Prop AI-20M, Cockpit and Fixed Wing, NLG, MLG of B747 system, Virtual Cockpit\r\n                            Simulator for demonstration of Practical Training Program for aspiring Aircraft Maintenance\r\n                            Engineering (AME) students. The institute has an agreement for practical training with all\r\n                            the national leading Airlines and with few renowned international MROs. TIAT organized a felicitation ceremony for successfully placed Students of Batch 0720, 0721 & their Parents. Join us in acknowledging the remarkable achievements of our\r\n                            distinguished alumni who have\r\n                            soared to great heights in the field of Aircraft Maintenance Engineering (AME). These\r\n                            trailblazers have not only completed their education with us but have also left an indelible\r\n                            mark on the aviation industry. Their stories of dedication, expertise, and resilience serve\r\n                            as beacons for aspiring professionals in AME, motivating to strive for excellence and make\r\n                            meaningful contributions to the dynamic and ever-evolving field of aviation. Thakur not only made our foundations strong, it made sure the whole building was\r\n                                    made\r\n                                    with quality. We were never forced to follow a schedule, we were given equal chances\r\n                                    to\r\n                                    be in the theory class as well as on the practicals even when not scheduled which\r\n                                    gave\r\n                                    us more exposure. I have been selected for IndiGo airlines as an associate JTO-PLM. I am thankful to\r\n                                    Thakur Institute of Aviation Technology (TIAT) for their constant support and\r\n                                    guidance.\r\n                                    Thanks TIAT for always being there for me as it wouldn’t have been possible\r\n                                    without you. Great engineers are made, not born. A man may possess good eyesight , sensitive\r\n                                    hands\r\n                                    and perfect coordination, but the end result is only fashioned by steady coaching\r\n                                    from\r\n                                    TIAT. I pursued the Avionics stream in Thakur Aviation and in a duration of three years I\r\n                                    came\r\n                                    across class apart teaching and infrastructure. The college has the best workshops\r\n                                    and\r\n                                    labs where we were exposed to real aircraft parts and materials. Thakur Institute Of Aviation Technology is 1 of the finest and DGCA Recognized AME\r\n                                    college in India. College gives us the strong foundation with respect to studies,\r\n                                    helps\r\n                                    us build ourselves with the Hi-Tech Labs & qualified and well experienced\r\n                                    Instructors. We are thrilled to announce that our institute has achieved\r\n                            remarkable success in placing our\r\n                            talented Aircraft Maintenance Engineering (AME) students in leading aviation organizations.\r\n                            Our commitment to providing quality education and industry-relevant training has resulted in\r\n                            excellent career opportunities in the aviation industry. Frequently Asked Questions (FAQ) for Aircraft Maintenance\r\n                            Engineering (AME) An Aircraft Maintenance Engineer (AME) is a highly skilled professional responsible for\r\n                                ensuring the safety and airworthiness of aircraft. AMEs perform inspections,\r\n                                maintenance, and repairs on various aircraft components, including engines, avionics,\r\n                                and structures. To become an AME, one typically needs to complete a formal training program from an\r\n                                aviation\r\n                                maintenance institute approved by aviation authorities. The training includes\r\n                                theoretical\r\n                                knowledge and hands-on experience. Thakur Institute of Aviation Technology is the best AME institute in India approved by\r\n                                DGCA, EASA,\r\n                                GCAA, BCAA and CAAB. Best education facilities with experienced and qualified\r\n                                instructors, and the\r\n                                best learning environment. Aspiring AMEs must be completed 10+2 class with (PCM) OR Diploma in\r\n                                Aeronautical,Mechanical,Electrical and Electronics recognized by State Technical\r\n                                Education Board. 10th and above No CET required. One can apply for AME 2024 through the online/offline. For online vist to know more about the\r\n                                admission process please visit institute. The salary of an AME can vary based on factors like experience, location, and the type of\r\n                                aircraft they work on. On average, AMEs enjoy competitive salaries, with the potential\r\n                                for higher earnings as they gain expertise. Job demand for AMEs is driven by the continuous growth of the aviation industry. Skilled\r\n                                AMEs are in demand globally, and the career offers stability and long-term prospects. To begin a career as an AME, enroll in an accredited training program with TIAT, gain\r\n                                practical experience through internships or apprenticeships, and obtain the necessary\r\n                                national or international certifications. Yes, TIAT provides specific scholarships for female students and merit-based scholarships\r\n                                for male students who wish to pursue a career in Aircraft Maintenance Engineering. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in achived successful job placemets through campus interview to Thakur Institute of Aviation Technology with TIAT -Where Passion and Precision Collide with State-of-the-Art Hangars and Technical Laboratories. for Real-world Impact. through Live Aircraft and a World of Aircraft Components. in 18 Years of Excellence at TIAT for the Best AME Institute in India NEWS FLASH TIAT Welcome Nurturing Aviation Careers Aviation Excellence Actual  Environmental Training Enhancing Training Soaring Together with 2300+ Students Academic Leadership Award What is an Aircraft Maintenance Engineer\r\n                                (AME)? How to become an AME? Which institute is best for AME? What qualifications are required to become an\r\n                                AME? How do I apply for AME Admission process\r\n                                2024? What is the earning potential for AME? What is job demand for AME? How can I start a career as an AME? Is there any scholarship for Aircraft Maintenance\r\n                                Engineering? × National & International Approvals Our Courses Highlights Live Aircrafts at our Campus \"Creating Futures, Winning Trust: Parents' Testimonials\" Our Successful Alumni Our Students were placed Need help? Try our FAQ's Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Directorate General\r\n                            of Civil Aviation (DGCA) European Union Aviation Safety Agency (EASA) General Civil Aviation Authority (GCAA) Airbus A320 Family Type Training Bhutan Civil Aviation Authority (BCAA) Civil Aviation Authority, Bangladesh (CAAB) Aircraft Maintenance Engineering (Approved by DGCA) Aircraft Maintenance License (Approved by EASA/GCAA/BCAA) B.Sc in Aeronautics (Approved by UGC) About TIAT Quick links Contact us Admissions Open for 2024-25 18+ years of Academic Excellence Aviation Authority Approval - National & International Professional Trained Internationally Experienced Faculties Cutting-Edge Curriculum Live Aircraft- from Cockpit to Wings Well-equipped Hangars and Technical Laboratory State-of-the-art Infrastructure & Amenities Actual Environmental Training Placements: All around the Globe Call us for more information Please fill the details B1.1\r\n                                    (Heavy Aeroplane & Turbine Engine) B1.3\r\n                                    (Helicopter & Turbine Engine) B2\r\n                                    (Avionics) B1.1\r\n                                    (Heavy Aeroplane & Turbine Engine) B2\r\n                                    (Avionics) B.Sc in Aeronautics\r\n                                    (Avionics) B.Sc in Aeronautics\r\n                                    (Mechanical) 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/syllabus-avionics.php", "content": "Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × B.Sc. Aeronautics (Avionics) Syllabus Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / First Year Second Year Third Year About TIAT Quick links Contact us Please fill the details B.Sc. Aeronautics (Avionics) 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory SR.No. Semester - I Semester - II SR.No. Semester - III Semester - IV SR.No. Semester - V Semester - VI 1 Basic Aerodynamics Electrical Fundamentals - II 2 Workshop Technology Electronic Fundamentals 3 Electrical Fundamentals - I Maintenance practices - I 4 Engineering Drawing Aircraft Structure 5 Human factors / Communication\r\n                                        Skill Environmental Studies 6 Basic Aerodynamics & Workshop\r\n                                        Technology (Practical) Electrical Fundamentals - II\r\n                                        (Practical) 7 Electrical Fundamentals - I\r\n                                        (Practical) Electronic Fundamentals\r\n                                        (Practical) 8 Engineering Drawing - I\r\n                                        (Practical) Aircraft Structure & maintenance\r\n                                        practices 1 Maintenance Practices - II Aircraft Instrument System - I 2 Aviation Legislation - I Engine & System 3 Digital & Computer Techniques Communication / Navigation System 4 Aircraft Material Power Distribution 5 Theory of Flight & Flight Controls Propulsion 6 Aircraft Materials & Maintenance - II\r\n                                        (Practices) Aircraft Instrument System - I 7 Communication / Navigation System 8 Power Distribution & Propulsion 1 Airframe System - I Aircraft Electricity & Instrument Snag\r\n                                        Analysis & Rectification 2 Landing Gear, Wheels & Brakes Aircraft Radio navigation Snag Analysis\r\n                                        & Rectification 3 Airframe System - II Engine Ignition System: Jet Engine &\r\n                                        Piston Engine 4 Digital Techniques - II Ground Handling & Documentation 5 Aircraft Fuel and Fuel System Innovative Project on Electrical System or\r\n                                        Instrument System or Radio Navigation System"}
{"url": "https://tiatmumbai.in/BSC-Aeronautics.php", "content": "TIAT under the flag of Thakur Shyamnarayan Degree College received approval to conduct B.Sc.\r\n                            Aeronautics courses in Mumbai (Mechanical and Avionics) in Affiliation with Mumbai\r\n                            University. It is an interdisciplinary skill that involves courses based on related sciences\r\n                            and designing as per with AME/AML Syllabus. A Bachelor of Science (BSc) in Aeronautical includes a wide range of topics related to the\r\n                            design, development, and maintenance of aircraft and aerospace systems. The program is\r\n                            divided into two specializations: Mechanical and Avionics. TIAT is the first basic maintenance training organization in India having a full-fledged\r\n                            AR/VR lab wherein the students can comprehend the Aircraft system and components\r\n                            realistically. The institute has an agreement with all the national leading Airlines and\r\n                            with a few renowned international MROs for practical training. HSC (10+2) with minimum 45% marks in aggregate with English, Physics and mathematics\r\n                            subjects or Diploma (10+3) awarded by MSBTE or equivalent by any other Government body. HSC (10+2) with minimum 45% marks in aggregate with English, Physics, and mathematics\r\n                            subjects or Diploma (10+3) awarded by MSBTE or equivalent by any other Government body. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × B.Sc Aeronautics Engineering Course details Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Course Syllabus (Mumbai University) Semester-wise Course details (Avionics) Semester-wise Course details (Mechanical) Eligibility Criteria Admission Procedure Document Submission Terms & Condition for the Students About TIAT Quick links Contact us B.Sc. Aeronautics in Mumbai (Avionics) B.Sc. Aeronautics in Mumbai (Mechanical) Please fill the details B.Sc Aeronautics Engg.\r\n                                        (Avionics/Mechanical) Applications for admission are made available in the prescribed form along with the\r\n                                prospectus at the institute. Eligible candidates seeking admission to AML course should submit their application\r\n                                form complete in all respect, together with necessary documents, to the institute's\r\n                                office as per the schedule issued by institute. Any application, which is incomplete or not accompanied by the prescribed documents,\r\n                                will be liable for rejection. \"Letter of Admission\" will be issued after the selection by scrutiny of the necessary\r\n                                documents & payment of fees in full. Foreign nationals & NRI candidates seeking admission to the course should submit their\r\n                                photocopies of passport, qualification certificates. Attested copy of Statement of marks of SSC or Equivalent Certificates.\r\n                                (Original to be submitted at the time of admission) Attested copy of Leaving Certificate issued by the School/ College, if applicable.\r\n                                (Original to be submitted at the time of admission) Attested copy of Transfer Certificate from the last attended institute, if applicable.\r\n                                (Original to be submitted at the time of admission) 10 Passport size colour Photograph duly signed on back by the candidate. Attested copy of Passport. During the admission process, I have been explained the disciplinary rules\r\n                                of the Institution and I have understood the same. I was also made aware of the\r\n                                Code of\r\n                                Conduct, Academic Rules, attendance, Examination Rules, Uniform and Library\r\n                                Policy\r\n                                of the Institute and I have understood the same. I as parent/s hereby undertake to diligently pay all Institute fees on time. I will attend all the classes from the re-opening day of the Institute on\r\n                                ………….or as per the timetable, failing which I am\r\n                                liable\r\n                                to pay a fine at the rate of Rs.100/- per day for the first one week. In\r\n                                case, I do\r\n                                not turn up even after one week of starting of classes, I shall be\r\n                                ineligible to\r\n                                continue for the current academic year. I will be regular and punctual to all the classes (theory/practical/drawing)\r\n                                and\r\n                                secure attendance of not less than 90% in each subject as stipulated by\r\n                                Institute. I will compulsorily follow the uniform prescribed by the Institute. I will conduct myself in a highly disciplined and decent manner both inside\r\n                                the\r\n                                classroom and in the campus, failing which suitable action may be taken\r\n                                against me\r\n                                as per the rules and regulations of the Institute. I will concentrate on my studies without wasting time in the\r\n                                Campus/Hostel/Residence\r\n                                and attend all the tests to secure more than the minimum prescribed Class /\r\n                                Sessional Marks in each subject. I will submit the assignments given in time\r\n                                to\r\n                                improve my performance. I will not use Mobile Phone to the Institute campus and also, I will not\r\n                                involve in\r\n                                any form of ragging inside or outside the campus. I am fully aware that\r\n                                bringing\r\n                                mobile phone to the campus and involving in Ragging activities is an offence\r\n                                and\r\n                                punishable as per Institute rules/Law. I will pay tuition fees, examination fees and any other dues within the\r\n                                stipulated\r\n                                time as required by the Institute authorities failing which I may not be\r\n                                permitted\r\n                                to attend the classes. I will not cause or involve in any sort of violence or disturbance both\r\n                                within and\r\n                                outside the Institute campus. If I become absent continuously for 3 days, my parents will have to meet the\r\n                                concerned Training Manager/Dy. Training Manager. Action against ragging: Maharashtra Prohibition of Ragging Act 1999 which is\r\n                                in\r\n                                effect from 15th May 1999 has the following provisions for Action against\r\n                                Ragging. Ragging within or outside of any educational institution is\r\n                                        prohibited, Whosoever directly or indirectly commits, participates in, abets, or\r\n                                        propagates ragging within or outside any Educational institution\r\n                                        shall, on\r\n                                        conviction, be punished with imprisonment for a term up to 2 years\r\n                                        and / or\r\n                                        penalty as per Ragging Act 1999. Any student convicted of an offence of ragging shall be dismissed\r\n                                        from the\r\n                                        educational institution and such student shall not be admitted in\r\n                                        any other\r\n                                        educational institution for a period of five years from the date of\r\n                                        order of\r\n                                        such dismissal. 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/AML-course.php", "content": "The main features of Aircraft Maintenance License course approved by EASA Part 147 (Basic)\r\n                            conducted by Thakur Institute of Aviation Technology are as follows: The course consists of 2400 hours program divided into 4 semesters. This includes\r\n                            theoretical training and practical training. Out of total practical training 30% of the\r\n                            practical training hours will be carried out in 145 Maintenance Organisations i.e. Actual\r\n                            Environment Training (AET) for all B1.1 and B2 categories. The remaining practical training\r\n                            (70%) will be carried out in various labs and on Learjet aircraft placed in Thakur Vidya\r\n                            Mandir (TVM) hangar. The practical task will cover the subject knowledge and aircraft\r\n                            systems. For AET purpose TIAT has long term agreement with 145 organisations to impart\r\n                            practical training to the students. Students are required to pass the module examinations\r\n                            conducted by this Institute on behalf of EASA. Students will be issued with Certificate of\r\n                            Recognition on successful completion of training course. Admission to Aircraft Maintenance License Courses\r\n                    in:- Minimum SSC (Secondary School Certificate) Or equivalent qualifications. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH (Heavy\r\n                                    Aeroplane & Turbine\r\n                                    Engine) 28 seats 02 Years (Avionics) 28 seats 02 Years × Aircraft Maintenance License Course Details Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Course Structure B1.1 B2 Eligibility Criteria Admission Procedure Document Submission Course Structure Terms & Condition for the Students About TIAT Quick links Contact us Please fill the details Aircraft Maintenance\r\n                                        License Applications for admission are made available in the prescribed form along with the\r\n                        prospectus at the Institute. Eligible candidates seeking admission to AML course should submit their application\r\n                        form complete in all respect, together with necessary documents, to the Institute's\r\n                        office as per the schedule issued by Institute. Any application, which is incomplete or not accompanied by the prescribed documents,\r\n                        will be liable for rejection. \"Letter of Admission\" will be issued after the selection by scrutiny of the necessary\r\n                        documents & payment of fees in full. Foreign nationals & NRI candidates seeking admission to the course should submit their\r\n                        photocopies of passport, qualification certificates. Attested copy of Statement of marks of SSC or Equivalent Certificates.\r\n                        (Original to be submitted at the time of admission) Attested copy of Leaving Certificate issued by the School/ College, if applicable.\r\n                        (Original to be submitted at the time of admission) Attested copy of Transfer Certificate from the last attended Institute, if applicable.\r\n                        (Original to be submitted at the time of admission) 10 Passport size colour Photograph duly signed on back by the candidate. Attested copy of Passport. During the admission process, I have been explained the disciplinary rules\r\n                    of the Institution and I have understood the same. I was also made aware of the\r\n                    Code of\r\n                    Conduct, Academic Rules, attendance, Examination Rules, Uniform and Library\r\n                    Policy\r\n                    of the Institute and I have understood the same. I as parent/s hereby undertake to diligently pay all Institute fees on time. I will attend all the classes from the re-opening day of the Institute on\r\n                    ………….or as per the timetable, failing which I am\r\n                    liable\r\n                    to pay a fine at the rate of Rs.100/- per day for the first one week. In\r\n                    case, I do\r\n                    not turn up even after one week of starting of classes, I shall be\r\n                    ineligible to\r\n                    continue for the current academic year. I will be regular and punctual to all the classes (theory/practical/drawing)\r\n                    and\r\n                    secure attendance of not less than 90% in each subject as stipulated by\r\n                    Institute. I will compulsorily follow the uniform prescribed by the Institute. I will conduct myself in a highly disciplined and decent manner both inside\r\n                    the\r\n                    classroom and in the campus, failing which suitable action may be taken\r\n                    against me\r\n                    as per the rules and regulations of the Institute. I will concentrate on my studies without wasting time in the\r\n                    Campus/Hostel/Residence\r\n                    and attend all the tests to secure more than the minimum prescribed Class /\r\n                    Sessional Marks in each subject. I will submit the assignments given in time\r\n                    to\r\n                    improve my performance. I will not use Mobile Phone to the Institute campus and also, I will not\r\n                    involve in\r\n                    any form of ragging inside or outside the campus. I am fully aware that\r\n                    bringing\r\n                    mobile phone to the campus and involving in Ragging activities is an offence\r\n                    and\r\n                    punishable as per Institute rules/Law. I will pay tuition fees, examination fees and any other dues within the\r\n                    stipulated\r\n                    time as required by the Institute authorities failing which I may not be\r\n                    permitted\r\n                    to attend the classes. I will not cause or involve in any sort of violence or disturbance both\r\n                    within and\r\n                    outside the Institute campus. If I become absent continuously for 3 days, my parents will have to meet the\r\n                    concerned Training Manager/Dy. Training Manager. Action against ragging: Maharashtra Prohibition of Ragging Act 1999 which is\r\n                    in\r\n                    effect from 15th May 1999 has the following provisions for Action against\r\n                    Ragging. Ragging within or outside of any educational institution is\r\n                            prohibited, Whosoever directly or indirectly commits, participates in, abets, or\r\n                            propagates ragging within or outside any Educational institution\r\n                            shall, on\r\n                            conviction, be punished with imprisonment for a term up to 2 years\r\n                            and / or\r\n                            penalty as per Ragging Act 1999. Any student convicted of an offence of ragging shall be dismissed\r\n                            from the\r\n                            educational institution and such student shall not be admitted in\r\n                            any other\r\n                            educational institution for a period of five years from the date of\r\n                            order of\r\n                            such dismissal. 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory Module No. Subject / Module Name B1.1 B2 1 Mathematics √ √ 2 Physics √ √ 3 Electrical Fundamentals √ √ 4 Electronic Fundamentals √ √ 5 Digital Techniques /Electronic Instrument Systems √ √ 6 Materials and Hardware √ √ 7A Maintenance Practices √ √ 8 Basic Aerodynamics √ √ 9A Human Factors √ √ 10 Aviation Legislation √ √ 11A Turbine Aeroplane Aerodynamics, Structures and Systems √ Ꭓ 12 Helicopter Aerodynamics, Structures and Systems Ꭓ Ꭓ 13 Aircraft Aerodynamics, Structures and Systems Ꭓ √ 14 Propulsion Ꭓ √ 15 Gas Turbine Engine √ Ꭓ 17A Propeller √ Ꭓ"}
{"url": "https://tiatmumbai.in/AME-course.php", "content": "The main features of Aircraft Maintenance Engineering course approved by DGCA conducted by\r\n                            Thakur Institute of Aviation Technology are as follows:\r\n                            The course consists of 2400 hours program divided into 4 semesters. This includes\r\n                            theoretical training and practical training. Out of total practical training 30% of the\r\n                            practical training hours will be carried out in CAR 145 Maintenance Organisations (Leading\r\n                            Airlines) i.e. Actual Environment Training (AET) for all B1.1, B2 and B1.3 categories. The\r\n                            remaining practical training (70%) will be carried out in various labs and on Inhouse\r\n                            aircrafts placed in Thakur Vidya Mandir (TVM) hangar. The practical task will cover the\r\n                            subject knowledge of aircraft systems. For AET purpose, TIAT has long term agreement with\r\n                            CAR 145 Maintenance Organisations (Leading Airlines) to impart practical training to the\r\n                            students. Students are required to pass the Semester examinations and DGCA Module\r\n                            examination. Students will be issued with Certificate of Recognition (CofR) on successful\r\n                            completion of training course. Admission to Aircraft Maintenance Engg. Courses\r\n                            in:- For Aircraft Maintenance Engineering training course, the candidates shall have\r\n                            passed\r\n                            minimum 10+2 class with Mathematics, Physics and Chemistry (PCM) from a\r\n                            recognised board\r\n                            or university or its equivalent. OR Diploma in Aeronautical,Mechanical,Electrical and Electronics recognized by\r\n                            State\r\n                            Technical Education Board Note: Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH (Heavy\r\n                                            Aeroplane & Turbine\r\n                                            Engine) 60 seats 02 Years (Helicopter & Turbine\r\n                                            Engine) 30 seats 02 Years (Avionics) 60 seats 02 Years × Aircraft Maintenance Engineering Course details Students List Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Course Structure B1.1 B1.3 B2 Eligibility Criteria Admission Procedure Document Submission Syllabus Semester-Wise Syllabus for Category B1.1 Semester-Wise Syllabus for Category B1.3 Semester-Wise Syllabus for Category B2 Course Fees Terms & Condition for the Students 2024-25 2023-24 2022-23 About TIAT Quick links Contact us Fees Policy for DGCA Two Years License Course of B1.1, B1.3 and B2 Please fill the details Aircraft Maintenance\r\n                                        Engineering Applications for admission are made available in the prescribed form along\r\n                                with the\r\n                                prospectus at the institute. Eligible candidates seeking admission to AME course should submit their\r\n                                application\r\n                                form completed in all respect, together with necessary documents, to the\r\n                                institute’s office as per the schedule issued by institute, which will\r\n                                be\r\n                                displayed on the institute’s notice board. Foreign nationals & NRI candidates seeking admission to the course\r\n                                should submit\r\n                                the necessary security clearance document from Ministry of Home Affairs,\r\n                                Govt. of\r\n                                India through DGCA. Any application, which is incomplete or not accompanied by the prescribed\r\n                                documents,\r\n                                will be liable for rejection. Attested copy of Statement of marks /Passing Certificate of SSC/HSC. Board Verification Certificate of SSC and HSC. Attested copy of Leaving Certificate issued by the College (Original to be\r\n                                submitted\r\n                                at the time of admission). Attested copy of Transfer Certificate from the last attended institute\r\n                                (Original to\r\n                                be submitted at the time of admission) Five Passport size color Photograph duly signed on back by the candidate. Medical certificate for Physical fitness issued by M.B.B.S. doctor &\r\n                                color\r\n                                Vision from Registered Medical Practitioner. Attested copy of Security Clearance documents from Ministry of Home affair,\r\n                                Govt. of\r\n                                India through DGCA for Foreign national& NRI’s candidates\r\n                                (Original to be\r\n                                submitted at the time of admission) Two Years OJT (On Job Training*Optional) Fee and AET fees are excluded from above fees and it is to be borned by the\r\n    students. Fee Collection is online mode ,visit our website: tiatmumbai.in > Admission > New Registration (National) or\r\n    Existing student and pay your fee by various modes ,QR Code,UPI,Internet Banking , Debit card and Credit card\r\n    (Service charges are waived off for any transaction) *If a student pays the total course fee at the time of admission, they will receive an 8% concession on the total course fee, and in the case of yearly payment, a 3% concession on the yearly fee paid. For Girls students concession / relaxtion based on their merit. Cancellation & fees refund policy are mentioned in student/parents undertaking letter. If a student fails to pay fee within stipulated period, fine may be levied by the management. The above fees are only for newly admitted students. On or before 15th July,2024 On or before 15th Jan,2025 On or before 15th July,2025 On or before 15th Jan,2026 During the admission process, I have been explained the disciplinary rules\r\n                                of the Institution and I have understood the same. I was also made aware of the\r\n                                Code of\r\n                                Conduct, Academic Rules, attendance, Examination Rules, Uniform and Library\r\n                                Policy\r\n                                of the Institute and I have understood the same. I as parent/s hereby undertake to diligently pay all Institute fees on time. I will attend all the classes from the re-opening day of the Institute on\r\n                                ………….or as per the timetable, failing which I am\r\n                                liable\r\n                                to pay a fine at the rate of Rs.100/- per day for the first one week. In\r\n                                case, I do\r\n                                not turn up even after one week of starting of classes, I shall be\r\n                                ineligible to\r\n                                continue for the current academic year. I will be regular and punctual to all the classes (theory/practical/drawing)\r\n                                and\r\n                                secure attendance of not less than 90% in each subject as stipulated by\r\n                                Institute. I will compulsorily follow the uniform prescribed by the Institute. I will conduct myself in a highly disciplined and decent manner both inside\r\n                                the\r\n                                classroom and in the campus, failing which suitable action may be taken\r\n                                against me\r\n                                as per the rules and regulations of the Institute. I will concentrate on my studies without wasting time in the\r\n                                Campus/Hostel/Residence\r\n                                and attend all the tests to secure more than the minimum prescribed Class /\r\n                                Sessional Marks in each subject. I will submit the assignments given in time\r\n                                to\r\n                                improve my performance. I will not use Mobile Phone to the Institute campus and also, I will not\r\n                                involve in\r\n                                any form of ragging inside or outside the campus. I am fully aware that\r\n                                bringing\r\n                                mobile phone to the campus and involving in Ragging activities is an offence\r\n                                and\r\n                                punishable as per Institute rules/Law. I will pay tuition fees, examination fees and any other dues within the\r\n                                stipulated\r\n                                time as required by the Institute authorities failing which I may not be\r\n                                permitted\r\n                                to attend the classes. I will not cause or involve in any sort of violence or disturbance both\r\n                                within and\r\n                                outside the Institute campus. If I become absent continuously for 3 days, my parents will have to meet the\r\n                                concerned Training Manager/Dy. Training Manager. Action against ragging: Maharashtra Prohibition of Ragging Act 1999 which is\r\n                                in\r\n                                effect from 15th May 1999 has the following provisions for Action against\r\n                                Ragging. Ragging within or outside of any educational institution is\r\n                                        prohibited, Whosoever directly or indirectly commits, participates in, abets, or\r\n                                        propagates ragging within or outside any Educational institution\r\n                                        shall, on\r\n                                        conviction, be punished with imprisonment for a term up to 2 years\r\n                                        and / or\r\n                                        penalty as per Ragging Act 1999. Any student convicted of an offence of ragging shall be dismissed\r\n                                        from the\r\n                                        educational institution and such student shall not be admitted in\r\n                                        any other\r\n                                        educational institution for a period of five years from the date of\r\n                                        order of\r\n                                        such dismissal. 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory Sr.No. Descrptions First Installment Second Installment Third Installment Fourth Installment Total Fees 1 Admission Fees 2,500.00 - 2,500.00 2 Tuition Fees 1,40,000.00 1,40,000.00 1,40,000.00 1,40,000.00 5,60,000.00 3 Semester Examination Fee 5,000.00 5,000.00 5,000.00 5,000.00 20,000.00 4 Library Fees 1,000.00 1,000.00 1,000.00 1,000.00 4,000.00 5 Workshop/Practical Fees 5,000.00 5,000.00 5,000.00 5,000.00 20,000.00 6 Development Fees 5,000.00 5,000.00 5,000.00 5,000.00 20,000.00 7 Extra Curiculam Fees 2,500.00 2,500.00 2,500.00 2,500.00 10,000.00 8 Uniform Fees 1,500.00 1,500.00 1,500.00 1,500.00 6,000.00"}
{"url": "https://tiatmumbai.in/about-easa.php", "content": "Approved and Recognized by Industry Leaders, With our prestigious approvals, you can be\r\n                            confident that you are receiving top-notch training that meets international standards. With approvals from organizations like the European Union\r\n                        Aviation Safety\r\n                        Agency (EASA), General Civil Aviation\r\n                        Authority (GCAA), Bhutan Civil Aviation Authority (BCAA) and Civil Aviation Authority of Bangladesh (CAAB) our students can join a\r\n                        plethora of Aviation Industries throughout the world. With doors open for jobs in national and international companies from all around the world\r\n                        like Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland,\r\n                        France, Germany, Greece, Hungary, Iceland, Ireland, Italy, Latvia, Liechtenstein, Lithuania,\r\n                        Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovenia, Spain, Sweden,\r\n                        Switzerland, through EASA the scope is limitless. GCAA offers opportunities in Middle Eastern countries while BCAA provides opportunities in\r\n                        Bhutan and DGCA is a National license. The aviation industry offers many job opportunities\r\n                        in AME, ranging from working for airlines, aircraft manufacturers, government agencies, and\r\n                        MROs. The demand for AME professionals is expected to grow in the coming years, making it an\r\n                        attractive career path for those interested in aviation. Read more Read more Read more Read more EASA’s Technical\r\n                                    Training aims to achieve and maintain the highest possible levels of competency, and\r\n                                    to remain current on the latest developments in aviation safety. The Agency promotes\r\n                                    the highest common standards of safety and environmental protection in civil\r\n                                    aviation in Europe and worldwide. It is the centerpiece of a new regulatory system,\r\n                                    which provides for a single European market in the aviation industry. EASA approves\r\n                                    maintenance training organizations in states other than member states of EU The Agency is developing close working relationship with\r\n                                    counterpart organization across\r\n                                    the world including the International Civil Aviation Organization (ICAO), the\r\n                                    Federal\r\n                                    Aviation Administration (FAA) in the United States and the aviation authorities\r\n                                    of Canada,\r\n                                    Brazil, Israel, China and Russia. Working arrangements between the agency and\r\n                                    these\r\n                                    organizations are aimed at harmonizing standards and promoting best practice in\r\n                                    aviation\r\n                                    safety world-wide. Thakur Institute of Aviation Technology (TIAT) has set upon itself a\r\n                                    responsibility\r\n                                    of\r\n                                    providing quality comparable to international standards and preparing students\r\n                                    for\r\n                                    aviation\r\n                                    industry. TIAT become the first ever Institute in India to get EASA (European\r\n                                    Union\r\n                                    Aviation\r\n                                    Safety Agency) approval under Part 147 Basic/Type Training organization. Thakur Institute of Aviation Technology is India's first AME Institute to get\r\n                                    approval of\r\n                                    GCAA (GENERAL CIVIL AVIATION AUTHORITY) in year 2021 from UAE, for Basic and\r\n                                    Type\r\n                                    Rating\r\n                                    Courses (A320 family along with CEO and NEO engines) in category B1, B2. Thakur Institute of Aviation Technology offers the basic Aircraft Maintenance\r\n                                    Engineering (AME) Course with approvals from organisations like Bhutan Civil\r\n                                    Aviation Authority (BCAA) our students can join a plethora of Aviation Industries\r\n                                    throughout the world. Thakur Institute of Aviation Technology offers the basic Aircraft Maintenance\r\n                                    Engineering (AME) Course with approvals from organisations like Civil\r\n                                    Aviation Authority, Bangladesh (CAAB) our students can join a plethora of Aviation\r\n                                    Industries\r\n                                    throughout the world. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × International Approval International Approvals EASA Approval Certificates GCAA Approval Certificates BCAA Approval Certificates CAAB Approval Certificates Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / European Union Aviation Safety Agency (EASA) General Civil Aviation Authority (GCAA) Bhutan Civil Aviation Authority (BCAA) Civil Aviation Authority, Bangladesh (CAAB) European Union Aviation Safety Agency (EASA) About EASA (European Union Aviation Safety Agency) Approved by European Union Aviation Safety Agency (EASA) General Civil Aviation Authority (GCAA) Approved by General Civil Aviation Authority (GCAA) Bhutan Civil Aviation Authority (BCCA) Approved by Bhutan Civil Aviation Authority (BCCA) Civil Aviation Authority, Bangladesh (CAAB) Approved by Civil Aviation Authority, Bangladesh (CAAB) About TIAT Quick links Contact us International co-operation Please fill the details International Approval (EASA,\r\n                                        GCAA, BCAA & CAAB) 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/about-ame.php", "content": "Directorate General of Civil Aviation is an attached office of\r\n                            the Ministry of Civil Aviation. The Directorate General of Civil Aviation is the regulatory body\r\n                            in the field of Civil Aviation primarily dealing with safety issues. It is responsible for\r\n                            regulation of air transport services to/from/within India and for enforcement of civil air\r\n                            regulations, air safety and airworthiness standards. It also co-ordinates all regulatory\r\n                            functions with International Civil Aviation Organisation. The headquarters are located in New Delhi with regional offices\r\n                            in the various parts of India. The AME certification is specialized licensing programme for\r\n                        servicing and maintenance of\r\n                        Aircraft and only those institutes approved by the DGCA can impart training in this field to\r\n                        prepare you for the AME exam conducted by the DGCA. DGCA will issue an AME licence. The salient features of Basic Aircraft Maintenance Engineering\r\n                        course based on CAR 147\r\n                        (Basic) conducted by Thakur Institute of Aviation Technology are mentioned below: The duration of this course is of 2 to 2.5 years (2400 hours) (4 semester) and students will be\r\n                        issued with\r\n                        Certificate of Recognition on successful completion of training course. Out of total\r\n                        practical training hours 70% of the practical training will be carried out Inhouse and 30%\r\n                        of the total practical training hours will be carried out in CAR 145 Maintenance\r\n                        Organisations (Leading Airlines) i.e. Actual Environment Training (AET) for all B1.1, B1.3 and\r\n                        B2 categories.\r\n                        The practical task will cover cross representative sections of the aircraft systems and\r\n                        accordingly TIAT has long term agreement with CAR 145 organisations (Leading Airlines) to impart\r\n                        practical\r\n                        training to the students undergoing CAR 147 Basic training in 2 to 2.5 years (2400 hours) of AME\r\n                        Curriculum.\r\n                        After successful completion of theoretical and practical training including Phasor\r\n                        examination (Semester Examinations) and Assessments the “Certificate of\r\n                        Recognition” will be issued to the students. Students are required to pass the\r\n                        semester/phasor module examinations of this institute along with DGCA modular examination. Aircraft Maintenance Engineers play a Major role among the Maintenance personnel to keep the\r\n                        Aircraft ‘Airworthy’ at all times. No Civil Aircraft reg. in India can be\r\n                        operated without being certified as Airworthy by the Aircraft Maintenance Engineer’s\r\n                        holding AME licenses in the respective categories. The maintenance of modern sophisticated\r\n                        aircraft calls for high degree of technical knowledge, competence, proficiency &\r\n                        integrity on the part of the concerned personnel. Tremendous responsibility lies upon the\r\n                        Aircraft Maintenance Engineers who are certifying the modern sophisticated Aircraft’s,\r\n                        manned by experienced crew trained at high cost and great care carrying the precious load of\r\n                        ever increasing number of passengers. Approval by Vide following Letter No. (previously E part VIII): D.G.C.A (Directorate of General Civil Aviation Authority) Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × National Approval D.G.C.A Approval Certificates Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / About Directorate General of Civil Aviation (D.G.C.A.) About Aircraft Maintenance Engineering (AME-DGCA Approved) TIAT's National Approvals About TIAT Quick links Contact us Please fill the details National Approval (DGCA) DGCA/CAR/147(B)/07 dated (07/08/2018) to\r\n                                    impart basic training for Categories B1.1 (Heavy Aeroplane & Turbine\r\n                                    Engine),\r\n                                    B1.3\r\n                                    (Helicopter & Turbine Engine) and B2 (Avionics)\r\n                                    approved by Directorate General of Civil\r\n                                    Aviation (D.G.C.A.), Government of India, New Delhi. Q3 TIAT / 1392 dated 24/03/2006,\r\n                                    Q3 TIAT / 5814 dated 21/11/2006, Q3\r\n                                    TIAT / 3629 dated 17/06/2008 under category ‘G’ Training School, to\r\n                                    impart ab-initio training in the field of Aircraft Maintenance Engineering for\r\n                                    obtaining Basic Licence in, Mechanical Stream: Heavy Aeroplane (HA), Light\r\n                                    Aeroplane\r\n                                    (LA), Jet Engine (JE) and Piston Engine (PE) Mechanical Stream: Rotary Wing\r\n                                    (RA),\r\n                                    Jet Engine (JE) and Piston Engine (PE) and Avionics Stream : Electrical System\r\n                                    (ES),\r\n                                    Instrument System (IS) and Radio Navigation System (RN). 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/visionary.php", "content": "Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH Chairman CEO Accountable Manager × Our Visionary Our Visionary Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / About TIAT Quick links Contact us V. K. SINGH RAJESH V. SINGH SUBHAJIT\r\n                                        MAITY Please fill the details Our Visionary 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/about-tiat.php", "content": ",\r\n                            Mumbai established in March 2006 has\r\n                            been elevating aviation excellence in education for almost 18 years to produce more than\r\n                            2300\r\n                            students to top-tier professionals in the field of aviation maintenance. In a stride towards\r\n                            global\r\n                            recognition TIAT is poised to secure national and international approval for its AME/AML\r\n                            programs & offering a holistic learning experience that combines theoretical knowledge\r\n                            with\r\n                            practical skills, preparing students for successful careers in the dynamic field of Aircraft\r\n                            Maintenance Engineering with an aim to make its students soar high in the sky.\r\n                            Thakur Institute of Aviation Technology (TIAT) Mumbai is always striving to provide its\r\n                            students with the best, be it the latest state-of-the infrastructure, top-class training\r\n                            support,\r\n                            immensely experienced faculties, through and well-structured curriculum; TIAT also gears\r\n                            towards providing job training and assistance programs to the students. TIAT offers\r\n                        top-notch\r\n                        placement offers in various international and national aviation industries. Not just\r\n                        academics, but\r\n                        the institution never fails to focus on the overall holistic development of the students by\r\n                        encouraging them to participate in several co-curriculum activities and providing them with\r\n                        a\r\n                        platform to display and showcase their talents. TIAT has a long list of achievements and excellent badges National approval by Directorate of General Civil Aviation, New Delhi, India for courses offered\r\n                        in categories Approval by Vide following Letter No. (previously E part VIII): TIAT offers the first-ever basic\r\n                                maintenance training organization in India with a full-fledged AR/VR lab (Augmented\r\n                                Reality/ Virtual Reality) wherein students can gain a realistic understanding of\r\n                                aircraft systems and their various components. TIAT under the flagship of Thakur\r\n                                Shyamnarayan Degree College received Approval to conduct B.Sc.Aeronautics\r\n                                Courses (Mechanical & Avionics) in affiliation with Mumbai University. TIAT trains its students after 10\r\n                                + 2 with PCM for a duration approx of 2 to 2.5 years (2400 hours completion) wherein the students undergo the\r\n                                basic theoretical and practical aspects including intense practical training in\r\n                                a real environment in various airlines. It has a responsibility to provide\r\n                                quality education and practical experience to students so that they meet the\r\n                                expectations set by the aviation industry worldwide. Thakur Institute of Aviation\r\n                                Technology has been awarded the Academic Leadership Award for 'Best Aircraft\r\n                                Maintenance Engineering Institute in India' by the MRO Association of India. TIAT also ranks top amongst all the\r\n                                AME (Aircraft Maintenance Engineering) colleges in India. It offers state-of-the-art\r\n                                infrastructure, the latest and updated technology, experienced faculties, a\r\n                                well-structured and thorough curriculum, and the best placement assistance in\r\n                                national and international aviation industries. TIAT comprehensively encourages\r\n                                students for their all-round holistic growth and development. Today's education sector is actively\r\n                                dominated by the latest technology and digital revolution. Thakur Institute of\r\n                                Aviation\r\n                                Technology leaves no stone unturned and offers its students with the finest\r\n                                technological educational practices such as Virtual Reality (VR) and Augmented\r\n                                Reality\r\n                                (AR), Microsoft HoloLens Mixed Reality (MR), sensors, and 3D visualization equipment\r\n                                such as CAVE Automatic Virtual Environment amongst various others. TIAT has taken\r\n                                this\r\n                                commendable step towards redefining education and enabling futuristic digital\r\n                                content in\r\n                                the classrooms to take practical education on a completely different level. This\r\n                                will\r\n                                help the students to comprehend the aircraft systems and components with a more\r\n                                realistic approach. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in TIAT is the first institute to ever launch a Basic Maintenance Training Organization in India to\r\n                    get approval from following international certification to impart basic Aircraft Maintenance\r\n                    Training. In order to engage the students in a more practical and empirical experience, TIAT also entered\r\n                    into several joint ventures with International Part-147 organizations to provide diverse\r\n                    aircraft\r\n                    training. Thakur Institute of Aviation Technology has taken upon the responsibility of providing\r\n                    its students with international standards of practical experience and preparing them to stand up\r\n                    to\r\n                    the high expectations and demands of the aviation industry. NEWS FLASH × About Why TIAT ? National & International Approvals Approval Certificates (National/Internaitonal) Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / About Thakur Institute of Aviation Technology TIAT's National Approvals TIAT's International Approvals TIAT is deemed the 'Best AME\r\n                                Training Institute' in India. Step into the Virtual world with TIAT State-of-the-Art Infrastructure at TIAT About TIAT Quick links Contact us To Impact Basic training to the Students of Aircraft Maintenance\r\n                                Engineering as per\r\n                                CAR\r\n                                147 (Basic) which includes catagories Please fill the details About Us B1.1 (Heavy Aeroplane and Turbine Engine), B1.3 (Helicopter and Turbine Engine) and B2 (Avionics) EASA (European Union Aviation Safety Agency), GCAA- (General Civil Aviation Authority, UAE) BCCA (Bhutan Civil Aviation Authority) and CAAB (Civil Aviation Authority of Bangladesh ) EASA PART 147 approval for Type Training of the A320 family along\r\n                            with CEO and NEO engines 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO Worls Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory DGCA/CAR/147(B)/07 dated (07/08/2018) to\r\n                                    impart basic training for Categories B1.1 (Heavy Aeroplane & Turbine Engine),\r\n                                    B1.3\r\n                                    (Helicopter & Turbine Engine) and B2 (Avionics)\r\n                                    approved by Directorate General of Civil\r\n                                    Aviation (D.G.C.A.), Government of India, New Delhi. Q3 TIAT / 1392 dated 24/03/2006,\r\n                                    Q3 TIAT / 5814 dated 21/11/2006, Q3\r\n                                    TIAT / 3629 dated 17/06/2008 under category ‘G’ Training School, to\r\n                                    impart ab-initio training in the field of Aircraft Maintenance Engineering for\r\n                                    obtaining Basic Licence in, Mechanical Stream: Heavy Aeroplane (HA), Light\r\n                                    Aeroplane\r\n                                    (LA), Jet Engine (JE) and Piston Engine (PE) Mechanical Stream: Rotary Wing\r\n                                    (RA),\r\n                                    Jet Engine (JE) and Piston Engine (PE) and Avionics Stream : Electrical System\r\n                                    (ES),\r\n                                    Instrument System (IS) and Radio Navigation System (RN). European Union Aviation Safety\r\n                                    Agency (EASA) General Civil Aviation Authority\r\n                                    (GCAA)of UAE EASA Part 147 Approval For Type\r\n                                    Training of A320 family alongwith CEO & NEO engines. Bhutan Civil Aviation Authority\r\n                                    (BCAA) Civil Aviation Authority of Bangladesh\r\n                                    (CAAB) B1.1 (Heavy Aeroplane & Turbine\r\n                                    Engine) B1.3 (Helicopter & Turbine\r\n                                    Engine) B2 (Avionics) The infrastructure at TIAT Mumbai encompasses CAR145 approved NDT labs which gives\r\n                                    students exposure to other\r\n                                    peripherals of aircraft maintenance activities as well. TIAT's live aircraft includes a Cessna 150M, Learjet 24, and an Enstrom-280C\r\n                                    helicopter. TIAT has a capsule of Boeing 747-200:-Cabin & JT9D7Q engine, fully equipped\r\n                                    Turbofan Engine, Turbo Prop AI-20M, Cockpit and Fixed Wing, NLG, MLG of B747\r\n                                    system for demonstration. TIAT has a Virtual Cockpit Simulator. TIAT has made an official agreement with many national and international\r\n                                    airlines and MROs to provide practical training and assistance to its students. 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/", "content": "is a highly respected\r\n                            education brand established in March 2006 with a motive to provide wings to students\r\n                            who want to pursue a career in the aviation sector with the Aircraft Maintenance\r\n                            Engineering course. Since then, over the past decade and a half, it has endeavoured\r\n                            to give the best to its students in terms of the state-of-the-art infrastructure,\r\n                            experienced faculty, training support, well-structured curriculum as well as On Job\r\n                            Training and placement assistance to the eligible students Nationally &\r\n                            Internationally in aviation industries and extensive participation of the students\r\n                            in co-curricular activities for their overall holistic development. National approval plays a crucial role in certifying AME courses\r\n                            through a rigorous process that ensures students meet the highest standards of safety and\r\n                            competence. International certification is recognized and accepted by numerous aviation\r\n                            authorities in countries around the world Embark on an exciting journey into the world of aviation with\r\n                            the\r\n                            Aircraft Maintenance\r\n                            Engineering (AME) course. Designed for enthusiasts passionate about aircraft and their\r\n                            intricate systems, this Courses equips with the necessary skills for the maintenance and\r\n                            repair of aircraft and knowledge to ensure the safety and reliability of aircraft. The\r\n                            curriculum is comprehensive, covering both theoretical and practical aspects to ensure\r\n                            students are well-prepared for the dynamic aviation industry. Discover the pinnacle of aviation education at Thakur Institute of\r\n                    Aviation Technology ( TIAT)\r\n                    institute, offering cutting-edge Aircraft Maintenance Engineering courses that soar above the rest.\r\n                    TIAT stands as a beacon of excellence, providing students with hands-on training, state-of-the-art\r\n                    facilities, and a curriculum designed to meet the dynamic needs of the aviation industry. Join us on\r\n                    a journey to soar to new heights in your aviation career– where excellence takes flight.\" Experience the thrill of dynamic and interactive environment where theory meets reality with\r\n                            hands-on learning on our Live Aircraft include Capsule of Boeing 747-200:-Cabin, Cessna\r\n                            150M, Learjet 24, an Enstrom-280C helicopter, & JT9D7Q engine, fully equipped Turbofan\r\n                            Engine, Turbo Prop AI-20M, Cockpit and Fixed Wing, NLG, MLG of B747 system, Virtual Cockpit\r\n                            Simulator for demonstration of Practical Training Program for aspiring Aircraft Maintenance\r\n                            Engineering (AME) students. The institute has an agreement for practical training with all\r\n                            the national leading Airlines and with few renowned international MROs. TIAT organized a felicitation ceremony for successfully placed Students of Batch 0720, 0721 & their Parents. Join us in acknowledging the remarkable achievements of our\r\n                            distinguished alumni who have\r\n                            soared to great heights in the field of Aircraft Maintenance Engineering (AME). These\r\n                            trailblazers have not only completed their education with us but have also left an indelible\r\n                            mark on the aviation industry. Their stories of dedication, expertise, and resilience serve\r\n                            as beacons for aspiring professionals in AME, motivating to strive for excellence and make\r\n                            meaningful contributions to the dynamic and ever-evolving field of aviation. Thakur not only made our foundations strong, it made sure the whole building was\r\n                                    made\r\n                                    with quality. We were never forced to follow a schedule, we were given equal chances\r\n                                    to\r\n                                    be in the theory class as well as on the practicals even when not scheduled which\r\n                                    gave\r\n                                    us more exposure. I have been selected for IndiGo airlines as an associate JTO-PLM. I am thankful to\r\n                                    Thakur Institute of Aviation Technology (TIAT) for their constant support and\r\n                                    guidance.\r\n                                    Thanks TIAT for always being there for me as it wouldn’t have been possible\r\n                                    without you. Great engineers are made, not born. A man may possess good eyesight , sensitive\r\n                                    hands\r\n                                    and perfect coordination, but the end result is only fashioned by steady coaching\r\n                                    from\r\n                                    TIAT. I pursued the Avionics stream in Thakur Aviation and in a duration of three years I\r\n                                    came\r\n                                    across class apart teaching and infrastructure. The college has the best workshops\r\n                                    and\r\n                                    labs where we were exposed to real aircraft parts and materials. Thakur Institute Of Aviation Technology is 1 of the finest and DGCA Recognized AME\r\n                                    college in India. College gives us the strong foundation with respect to studies,\r\n                                    helps\r\n                                    us build ourselves with the Hi-Tech Labs & qualified and well experienced\r\n                                    Instructors. We are thrilled to announce that our institute has achieved\r\n                            remarkable success in placing our\r\n                            talented Aircraft Maintenance Engineering (AME) students in leading aviation organizations.\r\n                            Our commitment to providing quality education and industry-relevant training has resulted in\r\n                            excellent career opportunities in the aviation industry. Frequently Asked Questions (FAQ) for Aircraft Maintenance\r\n                            Engineering (AME) An Aircraft Maintenance Engineer (AME) is a highly skilled professional responsible for\r\n                                ensuring the safety and airworthiness of aircraft. AMEs perform inspections,\r\n                                maintenance, and repairs on various aircraft components, including engines, avionics,\r\n                                and structures. To become an AME, one typically needs to complete a formal training program from an\r\n                                aviation\r\n                                maintenance institute approved by aviation authorities. The training includes\r\n                                theoretical\r\n                                knowledge and hands-on experience. Thakur Institute of Aviation Technology is the best AME institute in India approved by\r\n                                DGCA, EASA,\r\n                                GCAA, BCAA and CAAB. Best education facilities with experienced and qualified\r\n                                instructors, and the\r\n                                best learning environment. Aspiring AMEs must be completed 10+2 class with (PCM) OR Diploma in\r\n                                Aeronautical,Mechanical,Electrical and Electronics recognized by State Technical\r\n                                Education Board. 10th and above No CET required. One can apply for AME 2024 through the online/offline. For online vist to know more about the\r\n                                admission process please visit institute. The salary of an AME can vary based on factors like experience, location, and the type of\r\n                                aircraft they work on. On average, AMEs enjoy competitive salaries, with the potential\r\n                                for higher earnings as they gain expertise. Job demand for AMEs is driven by the continuous growth of the aviation industry. Skilled\r\n                                AMEs are in demand globally, and the career offers stability and long-term prospects. To begin a career as an AME, enroll in an accredited training program with TIAT, gain\r\n                                practical experience through internships or apprenticeships, and obtain the necessary\r\n                                national or international certifications. Yes, TIAT provides specific scholarships for female students and merit-based scholarships\r\n                                for male students who wish to pursue a career in Aircraft Maintenance Engineering. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in achived successful job placemets through campus interview to Thakur Institute of Aviation Technology with TIAT -Where Passion and Precision Collide with State-of-the-Art Hangars and Technical Laboratories. for Real-world Impact. through Live Aircraft and a World of Aircraft Components. in 18 Years of Excellence at TIAT for the Best AME Institute in India NEWS FLASH TIAT Welcome Nurturing Aviation Careers Aviation Excellence Actual  Environmental Training Enhancing Training Soaring Together with 2300+ Students Academic Leadership Award What is an Aircraft Maintenance Engineer\r\n                                (AME)? How to become an AME? Which institute is best for AME? What qualifications are required to become an\r\n                                AME? How do I apply for AME Admission process\r\n                                2024? What is the earning potential for AME? What is job demand for AME? How can I start a career as an AME? Is there any scholarship for Aircraft Maintenance\r\n                                Engineering? × National & International Approvals Our Courses Highlights Live Aircrafts at our Campus \"Creating Futures, Winning Trust: Parents' Testimonials\" Our Successful Alumni Our Students were placed Need help? Try our FAQ's Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Directorate General\r\n                            of Civil Aviation (DGCA) European Union Aviation Safety Agency (EASA) General Civil Aviation Authority (GCAA) Airbus A320 Family Type Training Bhutan Civil Aviation Authority (BCAA) Civil Aviation Authority, Bangladesh (CAAB) Aircraft Maintenance Engineering (Approved by DGCA) Aircraft Maintenance License (Approved by EASA/GCAA/BCAA) B.Sc in Aeronautics (Approved by UGC) About TIAT Quick links Contact us Admissions Open for 2024-25 18+ years of Academic Excellence Aviation Authority Approval - National & International Professional Trained Internationally Experienced Faculties Cutting-Edge Curriculum Live Aircraft- from Cockpit to Wings Well-equipped Hangars and Technical Laboratory State-of-the-art Infrastructure & Amenities Actual Environmental Training Placements: All around the Globe Call us for more information Please fill the details B1.1\r\n                                    (Heavy Aeroplane & Turbine Engine) B1.3\r\n                                    (Helicopter & Turbine Engine) B2\r\n                                    (Avionics) B1.1\r\n                                    (Heavy Aeroplane & Turbine Engine) B2\r\n                                    (Avionics) B.Sc in Aeronautics\r\n                                    (Avionics) B.Sc in Aeronautics\r\n                                    (Mechanical) 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/", "content": "is a highly respected\r\n                            education brand established in March 2006 with a motive to provide wings to students\r\n                            who want to pursue a career in the aviation sector with the Aircraft Maintenance\r\n                            Engineering course. Since then, over the past decade and a half, it has endeavoured\r\n                            to give the best to its students in terms of the state-of-the-art infrastructure,\r\n                            experienced faculty, training support, well-structured curriculum as well as On Job\r\n                            Training and placement assistance to the eligible students Nationally &\r\n                            Internationally in aviation industries and extensive participation of the students\r\n                            in co-curricular activities for their overall holistic development. National approval plays a crucial role in certifying AME courses\r\n                            through a rigorous process that ensures students meet the highest standards of safety and\r\n                            competence. International certification is recognized and accepted by numerous aviation\r\n                            authorities in countries around the world Embark on an exciting journey into the world of aviation with\r\n                            the\r\n                            Aircraft Maintenance\r\n                            Engineering (AME) course. Designed for enthusiasts passionate about aircraft and their\r\n                            intricate systems, this Courses equips with the necessary skills for the maintenance and\r\n                            repair of aircraft and knowledge to ensure the safety and reliability of aircraft. The\r\n                            curriculum is comprehensive, covering both theoretical and practical aspects to ensure\r\n                            students are well-prepared for the dynamic aviation industry. Discover the pinnacle of aviation education at Thakur Institute of\r\n                    Aviation Technology ( TIAT)\r\n                    institute, offering cutting-edge Aircraft Maintenance Engineering courses that soar above the rest.\r\n                    TIAT stands as a beacon of excellence, providing students with hands-on training, state-of-the-art\r\n                    facilities, and a curriculum designed to meet the dynamic needs of the aviation industry. Join us on\r\n                    a journey to soar to new heights in your aviation career– where excellence takes flight.\" Experience the thrill of dynamic and interactive environment where theory meets reality with\r\n                            hands-on learning on our Live Aircraft include Capsule of Boeing 747-200:-Cabin, Cessna\r\n                            150M, Learjet 24, an Enstrom-280C helicopter, & JT9D7Q engine, fully equipped Turbofan\r\n                            Engine, Turbo Prop AI-20M, Cockpit and Fixed Wing, NLG, MLG of B747 system, Virtual Cockpit\r\n                            Simulator for demonstration of Practical Training Program for aspiring Aircraft Maintenance\r\n                            Engineering (AME) students. The institute has an agreement for practical training with all\r\n                            the national leading Airlines and with few renowned international MROs. TIAT organized a felicitation ceremony for successfully placed Students of Batch 0720, 0721 & their Parents. Join us in acknowledging the remarkable achievements of our\r\n                            distinguished alumni who have\r\n                            soared to great heights in the field of Aircraft Maintenance Engineering (AME). These\r\n                            trailblazers have not only completed their education with us but have also left an indelible\r\n                            mark on the aviation industry. Their stories of dedication, expertise, and resilience serve\r\n                            as beacons for aspiring professionals in AME, motivating to strive for excellence and make\r\n                            meaningful contributions to the dynamic and ever-evolving field of aviation. Thakur not only made our foundations strong, it made sure the whole building was\r\n                                    made\r\n                                    with quality. We were never forced to follow a schedule, we were given equal chances\r\n                                    to\r\n                                    be in the theory class as well as on the practicals even when not scheduled which\r\n                                    gave\r\n                                    us more exposure. I have been selected for IndiGo airlines as an associate JTO-PLM. I am thankful to\r\n                                    Thakur Institute of Aviation Technology (TIAT) for their constant support and\r\n                                    guidance.\r\n                                    Thanks TIAT for always being there for me as it wouldn’t have been possible\r\n                                    without you. Great engineers are made, not born. A man may possess good eyesight , sensitive\r\n                                    hands\r\n                                    and perfect coordination, but the end result is only fashioned by steady coaching\r\n                                    from\r\n                                    TIAT. I pursued the Avionics stream in Thakur Aviation and in a duration of three years I\r\n                                    came\r\n                                    across class apart teaching and infrastructure. The college has the best workshops\r\n                                    and\r\n                                    labs where we were exposed to real aircraft parts and materials. Thakur Institute Of Aviation Technology is 1 of the finest and DGCA Recognized AME\r\n                                    college in India. College gives us the strong foundation with respect to studies,\r\n                                    helps\r\n                                    us build ourselves with the Hi-Tech Labs & qualified and well experienced\r\n                                    Instructors. We are thrilled to announce that our institute has achieved\r\n                            remarkable success in placing our\r\n                            talented Aircraft Maintenance Engineering (AME) students in leading aviation organizations.\r\n                            Our commitment to providing quality education and industry-relevant training has resulted in\r\n                            excellent career opportunities in the aviation industry. Frequently Asked Questions (FAQ) for Aircraft Maintenance\r\n                            Engineering (AME) An Aircraft Maintenance Engineer (AME) is a highly skilled professional responsible for\r\n                                ensuring the safety and airworthiness of aircraft. AMEs perform inspections,\r\n                                maintenance, and repairs on various aircraft components, including engines, avionics,\r\n                                and structures. To become an AME, one typically needs to complete a formal training program from an\r\n                                aviation\r\n                                maintenance institute approved by aviation authorities. The training includes\r\n                                theoretical\r\n                                knowledge and hands-on experience. Thakur Institute of Aviation Technology is the best AME institute in India approved by\r\n                                DGCA, EASA,\r\n                                GCAA, BCAA and CAAB. Best education facilities with experienced and qualified\r\n                                instructors, and the\r\n                                best learning environment. Aspiring AMEs must be completed 10+2 class with (PCM) OR Diploma in\r\n                                Aeronautical,Mechanical,Electrical and Electronics recognized by State Technical\r\n                                Education Board. 10th and above No CET required. One can apply for AME 2024 through the online/offline. For online vist to know more about the\r\n                                admission process please visit institute. The salary of an AME can vary based on factors like experience, location, and the type of\r\n                                aircraft they work on. On average, AMEs enjoy competitive salaries, with the potential\r\n                                for higher earnings as they gain expertise. Job demand for AMEs is driven by the continuous growth of the aviation industry. Skilled\r\n                                AMEs are in demand globally, and the career offers stability and long-term prospects. To begin a career as an AME, enroll in an accredited training program with TIAT, gain\r\n                                practical experience through internships or apprenticeships, and obtain the necessary\r\n                                national or international certifications. Yes, TIAT provides specific scholarships for female students and merit-based scholarships\r\n                                for male students who wish to pursue a career in Aircraft Maintenance Engineering. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in achived successful job placemets through campus interview to Thakur Institute of Aviation Technology with TIAT -Where Passion and Precision Collide with State-of-the-Art Hangars and Technical Laboratories. for Real-world Impact. through Live Aircraft and a World of Aircraft Components. in 18 Years of Excellence at TIAT for the Best AME Institute in India NEWS FLASH TIAT Welcome Nurturing Aviation Careers Aviation Excellence Actual  Environmental Training Enhancing Training Soaring Together with 2300+ Students Academic Leadership Award What is an Aircraft Maintenance Engineer\r\n                                (AME)? How to become an AME? Which institute is best for AME? What qualifications are required to become an\r\n                                AME? How do I apply for AME Admission process\r\n                                2024? What is the earning potential for AME? What is job demand for AME? How can I start a career as an AME? Is there any scholarship for Aircraft Maintenance\r\n                                Engineering? × National & International Approvals Our Courses Highlights Live Aircrafts at our Campus \"Creating Futures, Winning Trust: Parents' Testimonials\" Our Successful Alumni Our Students were placed Need help? Try our FAQ's Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Directorate General\r\n                            of Civil Aviation (DGCA) European Union Aviation Safety Agency (EASA) General Civil Aviation Authority (GCAA) Airbus A320 Family Type Training Bhutan Civil Aviation Authority (BCAA) Civil Aviation Authority, Bangladesh (CAAB) Aircraft Maintenance Engineering (Approved by DGCA) Aircraft Maintenance License (Approved by EASA/GCAA/BCAA) B.Sc in Aeronautics (Approved by UGC) About TIAT Quick links Contact us Admissions Open for 2024-25 18+ years of Academic Excellence Aviation Authority Approval - National & International Professional Trained Internationally Experienced Faculties Cutting-Edge Curriculum Live Aircraft- from Cockpit to Wings Well-equipped Hangars and Technical Laboratory State-of-the-art Infrastructure & Amenities Actual Environmental Training Placements: All around the Globe Call us for more information Please fill the details B1.1\r\n                                    (Heavy Aeroplane & Turbine Engine) B1.3\r\n                                    (Helicopter & Turbine Engine) B2\r\n                                    (Avionics) B1.1\r\n                                    (Heavy Aeroplane & Turbine Engine) B2\r\n                                    (Avionics) B.Sc in Aeronautics\r\n                                    (Avionics) B.Sc in Aeronautics\r\n                                    (Mechanical) 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/syllabus-mechanical.php", "content": "Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × B.Sc. Aeronautics (Mechanical) Syllabus Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / First Year Second Year Third Year About TIAT Quick links Contact us Please fill the details B.Sc. Aeronautics\r\n                                        (Mechanical) 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory SR.No. Semester - I Semester - II SR.No. Semester - III Semester - IV SR.No. Semester - V Semester - VI 1 Basic Aerodynamics Electrical Fundamentals - II 2 Workshop Technology Electronic Fundamentals 3 Electrical Fundamentals - I Maintenance practices - I 4 Engineering Drawing Aircraft Structure 5 Human factors / Communication Skill Environmental Studies 6 Basic Aerodynamics & Workshop Technology\r\n                                        (Practical) Aircraft Structure & maintenance\r\n                                        practices 7 Electrical Fundamentals - I\r\n                                        (Practical) 8 Engineering Drawing - I (Practical) 1 Maintenance Practices - II Aviation Legislation - II 2 Aviation Legislation - I Aircraft Fuel and Fuel System 3 Digital & Computer Techniques Aircraft hydraulic & Oxygen\r\n                                        System 4 Aircraft Materials Hydraulic & Oxygen System 5 Theory of Flight & Flight Controls Piston Engine & Systems 6 Aircraft Materials & Maintenance\r\n                                        Practices II Piston Engine & Aircraft Fuel\r\n                                        System Propeller 1 landing Gear, Wheels & Brakes Gas Turbine Engine - II 2 Cabin Atmosphere Control Ground Handling & Documentation 3 Gas Turbine Engine - II Airframe Snag Analysis &\r\n                                                Rectification 4 Airframe Structure - II Engine Snag Analysis &\r\n                                                Rectification 5 Aircraft Structure - II Airframe & Engine Snag Analysis &\r\n                                                Rectification 6 Landing Gear Innovative Project on Airframe System or\r\n                                                Engine System 7 Cabin Atmosphere Control & Aircraft\r\n                                                Structure - II"}
{"url": "https://tiatmumbai.in/syllabus-avionics.php", "content": "Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × B.Sc. Aeronautics (Avionics) Syllabus Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / First Year Second Year Third Year About TIAT Quick links Contact us Please fill the details B.Sc. Aeronautics (Avionics) 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory SR.No. Semester - I Semester - II SR.No. Semester - III Semester - IV SR.No. Semester - V Semester - VI 1 Basic Aerodynamics Electrical Fundamentals - II 2 Workshop Technology Electronic Fundamentals 3 Electrical Fundamentals - I Maintenance practices - I 4 Engineering Drawing Aircraft Structure 5 Human factors / Communication\r\n                                        Skill Environmental Studies 6 Basic Aerodynamics & Workshop\r\n                                        Technology (Practical) Electrical Fundamentals - II\r\n                                        (Practical) 7 Electrical Fundamentals - I\r\n                                        (Practical) Electronic Fundamentals\r\n                                        (Practical) 8 Engineering Drawing - I\r\n                                        (Practical) Aircraft Structure & maintenance\r\n                                        practices 1 Maintenance Practices - II Aircraft Instrument System - I 2 Aviation Legislation - I Engine & System 3 Digital & Computer Techniques Communication / Navigation System 4 Aircraft Material Power Distribution 5 Theory of Flight & Flight Controls Propulsion 6 Aircraft Materials & Maintenance - II\r\n                                        (Practices) Aircraft Instrument System - I 7 Communication / Navigation System 8 Power Distribution & Propulsion 1 Airframe System - I Aircraft Electricity & Instrument Snag\r\n                                        Analysis & Rectification 2 Landing Gear, Wheels & Brakes Aircraft Radio navigation Snag Analysis\r\n                                        & Rectification 3 Airframe System - II Engine Ignition System: Jet Engine &\r\n                                        Piston Engine 4 Digital Techniques - II Ground Handling & Documentation 5 Aircraft Fuel and Fuel System Innovative Project on Electrical System or\r\n                                        Instrument System or Radio Navigation System"}
{"url": "https://tiatmumbai.in/AML-course.php", "content": "The main features of Aircraft Maintenance License course approved by EASA Part 147 (Basic)\r\n                            conducted by Thakur Institute of Aviation Technology are as follows: The course consists of 2400 hours program divided into 4 semesters. This includes\r\n                            theoretical training and practical training. Out of total practical training 30% of the\r\n                            practical training hours will be carried out in 145 Maintenance Organisations i.e. Actual\r\n                            Environment Training (AET) for all B1.1 and B2 categories. The remaining practical training\r\n                            (70%) will be carried out in various labs and on Learjet aircraft placed in Thakur Vidya\r\n                            Mandir (TVM) hangar. The practical task will cover the subject knowledge and aircraft\r\n                            systems. For AET purpose TIAT has long term agreement with 145 organisations to impart\r\n                            practical training to the students. Students are required to pass the module examinations\r\n                            conducted by this Institute on behalf of EASA. Students will be issued with Certificate of\r\n                            Recognition on successful completion of training course. Admission to Aircraft Maintenance License Courses\r\n                    in:- Minimum SSC (Secondary School Certificate) Or equivalent qualifications. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH (Heavy\r\n                                    Aeroplane & Turbine\r\n                                    Engine) 28 seats 02 Years (Avionics) 28 seats 02 Years × Aircraft Maintenance License Course Details Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Course Structure B1.1 B2 Eligibility Criteria Admission Procedure Document Submission Course Structure Terms & Condition for the Students About TIAT Quick links Contact us Please fill the details Aircraft Maintenance\r\n                                        License Applications for admission are made available in the prescribed form along with the\r\n                        prospectus at the Institute. Eligible candidates seeking admission to AML course should submit their application\r\n                        form complete in all respect, together with necessary documents, to the Institute's\r\n                        office as per the schedule issued by Institute. Any application, which is incomplete or not accompanied by the prescribed documents,\r\n                        will be liable for rejection. \"Letter of Admission\" will be issued after the selection by scrutiny of the necessary\r\n                        documents & payment of fees in full. Foreign nationals & NRI candidates seeking admission to the course should submit their\r\n                        photocopies of passport, qualification certificates. Attested copy of Statement of marks of SSC or Equivalent Certificates.\r\n                        (Original to be submitted at the time of admission) Attested copy of Leaving Certificate issued by the School/ College, if applicable.\r\n                        (Original to be submitted at the time of admission) Attested copy of Transfer Certificate from the last attended Institute, if applicable.\r\n                        (Original to be submitted at the time of admission) 10 Passport size colour Photograph duly signed on back by the candidate. Attested copy of Passport. During the admission process, I have been explained the disciplinary rules\r\n                    of the Institution and I have understood the same. I was also made aware of the\r\n                    Code of\r\n                    Conduct, Academic Rules, attendance, Examination Rules, Uniform and Library\r\n                    Policy\r\n                    of the Institute and I have understood the same. I as parent/s hereby undertake to diligently pay all Institute fees on time. I will attend all the classes from the re-opening day of the Institute on\r\n                    ………….or as per the timetable, failing which I am\r\n                    liable\r\n                    to pay a fine at the rate of Rs.100/- per day for the first one week. In\r\n                    case, I do\r\n                    not turn up even after one week of starting of classes, I shall be\r\n                    ineligible to\r\n                    continue for the current academic year. I will be regular and punctual to all the classes (theory/practical/drawing)\r\n                    and\r\n                    secure attendance of not less than 90% in each subject as stipulated by\r\n                    Institute. I will compulsorily follow the uniform prescribed by the Institute. I will conduct myself in a highly disciplined and decent manner both inside\r\n                    the\r\n                    classroom and in the campus, failing which suitable action may be taken\r\n                    against me\r\n                    as per the rules and regulations of the Institute. I will concentrate on my studies without wasting time in the\r\n                    Campus/Hostel/Residence\r\n                    and attend all the tests to secure more than the minimum prescribed Class /\r\n                    Sessional Marks in each subject. I will submit the assignments given in time\r\n                    to\r\n                    improve my performance. I will not use Mobile Phone to the Institute campus and also, I will not\r\n                    involve in\r\n                    any form of ragging inside or outside the campus. I am fully aware that\r\n                    bringing\r\n                    mobile phone to the campus and involving in Ragging activities is an offence\r\n                    and\r\n                    punishable as per Institute rules/Law. I will pay tuition fees, examination fees and any other dues within the\r\n                    stipulated\r\n                    time as required by the Institute authorities failing which I may not be\r\n                    permitted\r\n                    to attend the classes. I will not cause or involve in any sort of violence or disturbance both\r\n                    within and\r\n                    outside the Institute campus. If I become absent continuously for 3 days, my parents will have to meet the\r\n                    concerned Training Manager/Dy. Training Manager. Action against ragging: Maharashtra Prohibition of Ragging Act 1999 which is\r\n                    in\r\n                    effect from 15th May 1999 has the following provisions for Action against\r\n                    Ragging. Ragging within or outside of any educational institution is\r\n                            prohibited, Whosoever directly or indirectly commits, participates in, abets, or\r\n                            propagates ragging within or outside any Educational institution\r\n                            shall, on\r\n                            conviction, be punished with imprisonment for a term up to 2 years\r\n                            and / or\r\n                            penalty as per Ragging Act 1999. Any student convicted of an offence of ragging shall be dismissed\r\n                            from the\r\n                            educational institution and such student shall not be admitted in\r\n                            any other\r\n                            educational institution for a period of five years from the date of\r\n                            order of\r\n                            such dismissal. 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory Module No. Subject / Module Name B1.1 B2 1 Mathematics √ √ 2 Physics √ √ 3 Electrical Fundamentals √ √ 4 Electronic Fundamentals √ √ 5 Digital Techniques /Electronic Instrument Systems √ √ 6 Materials and Hardware √ √ 7A Maintenance Practices √ √ 8 Basic Aerodynamics √ √ 9A Human Factors √ √ 10 Aviation Legislation √ √ 11A Turbine Aeroplane Aerodynamics, Structures and Systems √ Ꭓ 12 Helicopter Aerodynamics, Structures and Systems Ꭓ Ꭓ 13 Aircraft Aerodynamics, Structures and Systems Ꭓ √ 14 Propulsion Ꭓ √ 15 Gas Turbine Engine √ Ꭓ 17A Propeller √ Ꭓ"}
{"url": "https://tiatmumbai.in/syllabus-b2.php", "content": "Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Syllabus Category B2 Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Course Module: 3,6,9A,10 & Examination Module Scheme: 3,6,9A,10 (Semester-I) Course Module: 4,5,7A,8 & Examination Module Scheme: 4,5,7A,8 (Semester-II) Course Module: 13,14 & Examination Module Scheme: 13,14 (Semester-III) Course Module: 13 & Examination Module Scheme: 13 (Semester-IV) About TIAT Quick links Contact us Note: Please fill the details Syllabus Category B2 TH-Theory PR-Practical Course module is the module which will be taught in the particular semester. Examination module is the module of which exams will be conducted after completion of\r\n                                semester based on the consideration of the level & marks. Module 11A,12,13 and 15 are divided into two phase which will be covered in\r\n                                Semester-III and IV respectively 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory 1 3 Electrical Fundamental 2 6 Material & Hardware 3 9A Human Factor 4 10 Aviation Legislation 1 4 Electronics Fundamental 2 5 Digital Techniques / Electronics Instruments System 3 7A Maintenance Practices 4 8 Basic Aerodynamics 1 13 Aircraft Aerodynamics, Structure and system 2 14 Propulsion 1 13 Aircraft Aerodynamics, Structure and system"}
{"url": "https://tiatmumbai.in/syllabus-b1.3.php", "content": "Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Syllabus Category B1.3 Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Course Module: 3,6,9A,10 & Examination Module Scheme: 3,6,9A,10 (Semester-I) Course Module: 4,5,7A,8 & Examination Module Scheme: 4,5,7A,8 (Semester - II) Course Module: 12,15,17A & Examination Module Scheme: 12,15,17A (Semester -\r\n                            III) Course Module: 12,15 & Examination Module Scheme: 12,15 (Semester - IV) About TIAT Quick links Contact us Note: Please fill the details Syllabus Category B1.3 TH-Theory PR-Practical Course module is the module which will be taught in the particular semester. Examination module is the module of which exams will be conducted after completion of semester based on the consideration of the level & marks. Module 11A,12,13 and 15 are divided into two phase which will be covered in Semester-III and IV respectively 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory 1 3 Electrical Fundamental 2 6 Material & Hardware 3 9A Human Factor 4 10 Aviation Legislation 1 4 Electronics Fundamental 2 5 Digital Techniques / Electronics Instruments System 3 7A Maintenance Practices 4 8 Basic Aerodynamics 1 12 Helicopter Aerodynamics, Structures and Systems 2 15 Gas Turbine Engine 1 12 Helicopter Aerodynamics, Structures and Systems 2 15 Gas Turbine Engine"}
{"url": "https://tiatmumbai.in/syllabus-b1.1.php", "content": "Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Syllabus Category B1.1 Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Course Module: 3,6,9A,10 & Examination Module Scheme: 3,6,9A,10 (Semester-I) Course Module: 4,5,7A,8 & Examination Module Scheme: 4,5,7A,8 (Semester-II) Course Module: 11A,15,17A & Examination Module Scheme: 11A,15,17A (Semester-III) Course Module: 11A,15 & Examination Module Scheme: 11A,15 (Semester-IV) About TIAT Quick links Contact us Note: Please fill the details Syllabus Category B1.1 TH-Theory PR-Practical Course module is the module which will be taught in the particular semester. Examination module is the module of which exams will be conducted after completion of\r\n                                semester based on the consideration of the level & marks. Module 11A,12,13 and 15 are divided into two phase which will be covered in Semester-III\r\n                                and IV respectively 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory 1 3 Electrical Fundamental 2 6 Material & Hardware 3 9A Human Factor 4 10 Aviation Legislation 1 4 Electronics Fundamental 2 5 Digital Techniques / Electronics Instruments System 3 7A Maintenance Practices 4 8 Basic Aerodynamics 1 11A Turbine Aeroplane Aerodynamics, Structures and Systems 2 15 Gas Turbine Engine 3 17A Propeller 1 11A Turbine Aeroplane Aerodynamics, Structures and Systems 2 15 Gas Turbine Engine"}
{"url": "https://tiatmumbai.in/AME-course.php", "content": "The main features of Aircraft Maintenance Engineering course approved by DGCA conducted by\r\n                            Thakur Institute of Aviation Technology are as follows:\r\n                            The course consists of 2400 hours program divided into 4 semesters. This includes\r\n                            theoretical training and practical training. Out of total practical training 30% of the\r\n                            practical training hours will be carried out in CAR 145 Maintenance Organisations (Leading\r\n                            Airlines) i.e. Actual Environment Training (AET) for all B1.1, B2 and B1.3 categories. The\r\n                            remaining practical training (70%) will be carried out in various labs and on Inhouse\r\n                            aircrafts placed in Thakur Vidya Mandir (TVM) hangar. The practical task will cover the\r\n                            subject knowledge of aircraft systems. For AET purpose, TIAT has long term agreement with\r\n                            CAR 145 Maintenance Organisations (Leading Airlines) to impart practical training to the\r\n                            students. Students are required to pass the Semester examinations and DGCA Module\r\n                            examination. Students will be issued with Certificate of Recognition (CofR) on successful\r\n                            completion of training course. Admission to Aircraft Maintenance Engg. Courses\r\n                            in:- For Aircraft Maintenance Engineering training course, the candidates shall have\r\n                            passed\r\n                            minimum 10+2 class with Mathematics, Physics and Chemistry (PCM) from a\r\n                            recognised board\r\n                            or university or its equivalent. OR Diploma in Aeronautical,Mechanical,Electrical and Electronics recognized by\r\n                            State\r\n                            Technical Education Board Note: Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH (Heavy\r\n                                            Aeroplane & Turbine\r\n                                            Engine) 60 seats 02 Years (Helicopter & Turbine\r\n                                            Engine) 30 seats 02 Years (Avionics) 60 seats 02 Years × Aircraft Maintenance Engineering Course details Students List Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Course Structure B1.1 B1.3 B2 Eligibility Criteria Admission Procedure Document Submission Syllabus Semester-Wise Syllabus for Category B1.1 Semester-Wise Syllabus for Category B1.3 Semester-Wise Syllabus for Category B2 Course Fees Terms & Condition for the Students 2024-25 2023-24 2022-23 About TIAT Quick links Contact us Fees Policy for DGCA Two Years License Course of B1.1, B1.3 and B2 Please fill the details Aircraft Maintenance\r\n                                        Engineering Applications for admission are made available in the prescribed form along\r\n                                with the\r\n                                prospectus at the institute. Eligible candidates seeking admission to AME course should submit their\r\n                                application\r\n                                form completed in all respect, together with necessary documents, to the\r\n                                institute’s office as per the schedule issued by institute, which will\r\n                                be\r\n                                displayed on the institute’s notice board. Foreign nationals & NRI candidates seeking admission to the course\r\n                                should submit\r\n                                the necessary security clearance document from Ministry of Home Affairs,\r\n                                Govt. of\r\n                                India through DGCA. Any application, which is incomplete or not accompanied by the prescribed\r\n                                documents,\r\n                                will be liable for rejection. Attested copy of Statement of marks /Passing Certificate of SSC/HSC. Board Verification Certificate of SSC and HSC. Attested copy of Leaving Certificate issued by the College (Original to be\r\n                                submitted\r\n                                at the time of admission). Attested copy of Transfer Certificate from the last attended institute\r\n                                (Original to\r\n                                be submitted at the time of admission) Five Passport size color Photograph duly signed on back by the candidate. Medical certificate for Physical fitness issued by M.B.B.S. doctor &\r\n                                color\r\n                                Vision from Registered Medical Practitioner. Attested copy of Security Clearance documents from Ministry of Home affair,\r\n                                Govt. of\r\n                                India through DGCA for Foreign national& NRI’s candidates\r\n                                (Original to be\r\n                                submitted at the time of admission) Two Years OJT (On Job Training*Optional) Fee and AET fees are excluded from above fees and it is to be borned by the\r\n    students. Fee Collection is online mode ,visit our website: tiatmumbai.in > Admission > New Registration (National) or\r\n    Existing student and pay your fee by various modes ,QR Code,UPI,Internet Banking , Debit card and Credit card\r\n    (Service charges are waived off for any transaction) *If a student pays the total course fee at the time of admission, they will receive an 8% concession on the total course fee, and in the case of yearly payment, a 3% concession on the yearly fee paid. For Girls students concession / relaxtion based on their merit. Cancellation & fees refund policy are mentioned in student/parents undertaking letter. If a student fails to pay fee within stipulated period, fine may be levied by the management. The above fees are only for newly admitted students. On or before 15th July,2024 On or before 15th Jan,2025 On or before 15th July,2025 On or before 15th Jan,2026 During the admission process, I have been explained the disciplinary rules\r\n                                of the Institution and I have understood the same. I was also made aware of the\r\n                                Code of\r\n                                Conduct, Academic Rules, attendance, Examination Rules, Uniform and Library\r\n                                Policy\r\n                                of the Institute and I have understood the same. I as parent/s hereby undertake to diligently pay all Institute fees on time. I will attend all the classes from the re-opening day of the Institute on\r\n                                ………….or as per the timetable, failing which I am\r\n                                liable\r\n                                to pay a fine at the rate of Rs.100/- per day for the first one week. In\r\n                                case, I do\r\n                                not turn up even after one week of starting of classes, I shall be\r\n                                ineligible to\r\n                                continue for the current academic year. I will be regular and punctual to all the classes (theory/practical/drawing)\r\n                                and\r\n                                secure attendance of not less than 90% in each subject as stipulated by\r\n                                Institute. I will compulsorily follow the uniform prescribed by the Institute. I will conduct myself in a highly disciplined and decent manner both inside\r\n                                the\r\n                                classroom and in the campus, failing which suitable action may be taken\r\n                                against me\r\n                                as per the rules and regulations of the Institute. I will concentrate on my studies without wasting time in the\r\n                                Campus/Hostel/Residence\r\n                                and attend all the tests to secure more than the minimum prescribed Class /\r\n                                Sessional Marks in each subject. I will submit the assignments given in time\r\n                                to\r\n                                improve my performance. I will not use Mobile Phone to the Institute campus and also, I will not\r\n                                involve in\r\n                                any form of ragging inside or outside the campus. I am fully aware that\r\n                                bringing\r\n                                mobile phone to the campus and involving in Ragging activities is an offence\r\n                                and\r\n                                punishable as per Institute rules/Law. I will pay tuition fees, examination fees and any other dues within the\r\n                                stipulated\r\n                                time as required by the Institute authorities failing which I may not be\r\n                                permitted\r\n                                to attend the classes. I will not cause or involve in any sort of violence or disturbance both\r\n                                within and\r\n                                outside the Institute campus. If I become absent continuously for 3 days, my parents will have to meet the\r\n                                concerned Training Manager/Dy. Training Manager. Action against ragging: Maharashtra Prohibition of Ragging Act 1999 which is\r\n                                in\r\n                                effect from 15th May 1999 has the following provisions for Action against\r\n                                Ragging. Ragging within or outside of any educational institution is\r\n                                        prohibited, Whosoever directly or indirectly commits, participates in, abets, or\r\n                                        propagates ragging within or outside any Educational institution\r\n                                        shall, on\r\n                                        conviction, be punished with imprisonment for a term up to 2 years\r\n                                        and / or\r\n                                        penalty as per Ragging Act 1999. Any student convicted of an offence of ragging shall be dismissed\r\n                                        from the\r\n                                        educational institution and such student shall not be admitted in\r\n                                        any other\r\n                                        educational institution for a period of five years from the date of\r\n                                        order of\r\n                                        such dismissal. 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory Sr.No. Descrptions First Installment Second Installment Third Installment Fourth Installment Total Fees 1 Admission Fees 2,500.00 - 2,500.00 2 Tuition Fees 1,40,000.00 1,40,000.00 1,40,000.00 1,40,000.00 5,60,000.00 3 Semester Examination Fee 5,000.00 5,000.00 5,000.00 5,000.00 20,000.00 4 Library Fees 1,000.00 1,000.00 1,000.00 1,000.00 4,000.00 5 Workshop/Practical Fees 5,000.00 5,000.00 5,000.00 5,000.00 20,000.00 6 Development Fees 5,000.00 5,000.00 5,000.00 5,000.00 20,000.00 7 Extra Curiculam Fees 2,500.00 2,500.00 2,500.00 2,500.00 10,000.00 8 Uniform Fees 1,500.00 1,500.00 1,500.00 1,500.00 6,000.00"}
{"url": "https://tiatmumbai.in/uploads/prospectus/", "content": ""}
{"url": "https://tiatmumbai.in/about-easa.php", "content": "Approved and Recognized by Industry Leaders, With our prestigious approvals, you can be\r\n                            confident that you are receiving top-notch training that meets international standards. With approvals from organizations like the European Union\r\n                        Aviation Safety\r\n                        Agency (EASA), General Civil Aviation\r\n                        Authority (GCAA), Bhutan Civil Aviation Authority (BCAA) and Civil Aviation Authority of Bangladesh (CAAB) our students can join a\r\n                        plethora of Aviation Industries throughout the world. With doors open for jobs in national and international companies from all around the world\r\n                        like Austria, Belgium, Bulgaria, Croatia, Cyprus, Czechia, Denmark, Estonia, Finland,\r\n                        France, Germany, Greece, Hungary, Iceland, Ireland, Italy, Latvia, Liechtenstein, Lithuania,\r\n                        Luxembourg, Malta, Netherlands, Norway, Poland, Portugal, Romania, Slovenia, Spain, Sweden,\r\n                        Switzerland, through EASA the scope is limitless. GCAA offers opportunities in Middle Eastern countries while BCAA provides opportunities in\r\n                        Bhutan and DGCA is a National license. The aviation industry offers many job opportunities\r\n                        in AME, ranging from working for airlines, aircraft manufacturers, government agencies, and\r\n                        MROs. The demand for AME professionals is expected to grow in the coming years, making it an\r\n                        attractive career path for those interested in aviation. Read more Read more Read more Read more EASA’s Technical\r\n                                    Training aims to achieve and maintain the highest possible levels of competency, and\r\n                                    to remain current on the latest developments in aviation safety. The Agency promotes\r\n                                    the highest common standards of safety and environmental protection in civil\r\n                                    aviation in Europe and worldwide. It is the centerpiece of a new regulatory system,\r\n                                    which provides for a single European market in the aviation industry. EASA approves\r\n                                    maintenance training organizations in states other than member states of EU The Agency is developing close working relationship with\r\n                                    counterpart organization across\r\n                                    the world including the International Civil Aviation Organization (ICAO), the\r\n                                    Federal\r\n                                    Aviation Administration (FAA) in the United States and the aviation authorities\r\n                                    of Canada,\r\n                                    Brazil, Israel, China and Russia. Working arrangements between the agency and\r\n                                    these\r\n                                    organizations are aimed at harmonizing standards and promoting best practice in\r\n                                    aviation\r\n                                    safety world-wide. Thakur Institute of Aviation Technology (TIAT) has set upon itself a\r\n                                    responsibility\r\n                                    of\r\n                                    providing quality comparable to international standards and preparing students\r\n                                    for\r\n                                    aviation\r\n                                    industry. TIAT become the first ever Institute in India to get EASA (European\r\n                                    Union\r\n                                    Aviation\r\n                                    Safety Agency) approval under Part 147 Basic/Type Training organization. Thakur Institute of Aviation Technology is India's first AME Institute to get\r\n                                    approval of\r\n                                    GCAA (GENERAL CIVIL AVIATION AUTHORITY) in year 2021 from UAE, for Basic and\r\n                                    Type\r\n                                    Rating\r\n                                    Courses (A320 family along with CEO and NEO engines) in category B1, B2. Thakur Institute of Aviation Technology offers the basic Aircraft Maintenance\r\n                                    Engineering (AME) Course with approvals from organisations like Bhutan Civil\r\n                                    Aviation Authority (BCAA) our students can join a plethora of Aviation Industries\r\n                                    throughout the world. Thakur Institute of Aviation Technology offers the basic Aircraft Maintenance\r\n                                    Engineering (AME) Course with approvals from organisations like Civil\r\n                                    Aviation Authority, Bangladesh (CAAB) our students can join a plethora of Aviation\r\n                                    Industries\r\n                                    throughout the world. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × International Approval International Approvals EASA Approval Certificates GCAA Approval Certificates BCAA Approval Certificates CAAB Approval Certificates Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / European Union Aviation Safety Agency (EASA) General Civil Aviation Authority (GCAA) Bhutan Civil Aviation Authority (BCAA) Civil Aviation Authority, Bangladesh (CAAB) European Union Aviation Safety Agency (EASA) About EASA (European Union Aviation Safety Agency) Approved by European Union Aviation Safety Agency (EASA) General Civil Aviation Authority (GCAA) Approved by General Civil Aviation Authority (GCAA) Bhutan Civil Aviation Authority (BCCA) Approved by Bhutan Civil Aviation Authority (BCCA) Civil Aviation Authority, Bangladesh (CAAB) Approved by Civil Aviation Authority, Bangladesh (CAAB) About TIAT Quick links Contact us International co-operation Please fill the details International Approval (EASA,\r\n                                        GCAA, BCAA & CAAB) 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/about-ame.php", "content": "Directorate General of Civil Aviation is an attached office of\r\n                            the Ministry of Civil Aviation. The Directorate General of Civil Aviation is the regulatory body\r\n                            in the field of Civil Aviation primarily dealing with safety issues. It is responsible for\r\n                            regulation of air transport services to/from/within India and for enforcement of civil air\r\n                            regulations, air safety and airworthiness standards. It also co-ordinates all regulatory\r\n                            functions with International Civil Aviation Organisation. The headquarters are located in New Delhi with regional offices\r\n                            in the various parts of India. The AME certification is specialized licensing programme for\r\n                        servicing and maintenance of\r\n                        Aircraft and only those institutes approved by the DGCA can impart training in this field to\r\n                        prepare you for the AME exam conducted by the DGCA. DGCA will issue an AME licence. The salient features of Basic Aircraft Maintenance Engineering\r\n                        course based on CAR 147\r\n                        (Basic) conducted by Thakur Institute of Aviation Technology are mentioned below: The duration of this course is of 2 to 2.5 years (2400 hours) (4 semester) and students will be\r\n                        issued with\r\n                        Certificate of Recognition on successful completion of training course. Out of total\r\n                        practical training hours 70% of the practical training will be carried out Inhouse and 30%\r\n                        of the total practical training hours will be carried out in CAR 145 Maintenance\r\n                        Organisations (Leading Airlines) i.e. Actual Environment Training (AET) for all B1.1, B1.3 and\r\n                        B2 categories.\r\n                        The practical task will cover cross representative sections of the aircraft systems and\r\n                        accordingly TIAT has long term agreement with CAR 145 organisations (Leading Airlines) to impart\r\n                        practical\r\n                        training to the students undergoing CAR 147 Basic training in 2 to 2.5 years (2400 hours) of AME\r\n                        Curriculum.\r\n                        After successful completion of theoretical and practical training including Phasor\r\n                        examination (Semester Examinations) and Assessments the “Certificate of\r\n                        Recognition” will be issued to the students. Students are required to pass the\r\n                        semester/phasor module examinations of this institute along with DGCA modular examination. Aircraft Maintenance Engineers play a Major role among the Maintenance personnel to keep the\r\n                        Aircraft ‘Airworthy’ at all times. No Civil Aircraft reg. in India can be\r\n                        operated without being certified as Airworthy by the Aircraft Maintenance Engineer’s\r\n                        holding AME licenses in the respective categories. The maintenance of modern sophisticated\r\n                        aircraft calls for high degree of technical knowledge, competence, proficiency &\r\n                        integrity on the part of the concerned personnel. Tremendous responsibility lies upon the\r\n                        Aircraft Maintenance Engineers who are certifying the modern sophisticated Aircraft’s,\r\n                        manned by experienced crew trained at high cost and great care carrying the precious load of\r\n                        ever increasing number of passengers. Approval by Vide following Letter No. (previously E part VIII): D.G.C.A (Directorate of General Civil Aviation Authority) Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × National Approval D.G.C.A Approval Certificates Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / About Directorate General of Civil Aviation (D.G.C.A.) About Aircraft Maintenance Engineering (AME-DGCA Approved) TIAT's National Approvals About TIAT Quick links Contact us Please fill the details National Approval (DGCA) DGCA/CAR/147(B)/07 dated (07/08/2018) to\r\n                                    impart basic training for Categories B1.1 (Heavy Aeroplane & Turbine\r\n                                    Engine),\r\n                                    B1.3\r\n                                    (Helicopter & Turbine Engine) and B2 (Avionics)\r\n                                    approved by Directorate General of Civil\r\n                                    Aviation (D.G.C.A.), Government of India, New Delhi. Q3 TIAT / 1392 dated 24/03/2006,\r\n                                    Q3 TIAT / 5814 dated 21/11/2006, Q3\r\n                                    TIAT / 3629 dated 17/06/2008 under category ‘G’ Training School, to\r\n                                    impart ab-initio training in the field of Aircraft Maintenance Engineering for\r\n                                    obtaining Basic Licence in, Mechanical Stream: Heavy Aeroplane (HA), Light\r\n                                    Aeroplane\r\n                                    (LA), Jet Engine (JE) and Piston Engine (PE) Mechanical Stream: Rotary Wing\r\n                                    (RA),\r\n                                    Jet Engine (JE) and Piston Engine (PE) and Avionics Stream : Electrical System\r\n                                    (ES),\r\n                                    Instrument System (IS) and Radio Navigation System (RN). 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/visionary.php", "content": "Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH Chairman CEO Accountable Manager × Our Visionary Our Visionary Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / About TIAT Quick links Contact us V. K. SINGH RAJESH V. SINGH SUBHAJIT\r\n                                        MAITY Please fill the details Our Visionary 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/about-tiat.php", "content": ",\r\n                            Mumbai established in March 2006 has\r\n                            been elevating aviation excellence in education for almost 18 years to produce more than\r\n                            2300\r\n                            students to top-tier professionals in the field of aviation maintenance. In a stride towards\r\n                            global\r\n                            recognition TIAT is poised to secure national and international approval for its AME/AML\r\n                            programs & offering a holistic learning experience that combines theoretical knowledge\r\n                            with\r\n                            practical skills, preparing students for successful careers in the dynamic field of Aircraft\r\n                            Maintenance Engineering with an aim to make its students soar high in the sky.\r\n                            Thakur Institute of Aviation Technology (TIAT) Mumbai is always striving to provide its\r\n                            students with the best, be it the latest state-of-the infrastructure, top-class training\r\n                            support,\r\n                            immensely experienced faculties, through and well-structured curriculum; TIAT also gears\r\n                            towards providing job training and assistance programs to the students. TIAT offers\r\n                        top-notch\r\n                        placement offers in various international and national aviation industries. Not just\r\n                        academics, but\r\n                        the institution never fails to focus on the overall holistic development of the students by\r\n                        encouraging them to participate in several co-curriculum activities and providing them with\r\n                        a\r\n                        platform to display and showcase their talents. TIAT has a long list of achievements and excellent badges National approval by Directorate of General Civil Aviation, New Delhi, India for courses offered\r\n                        in categories Approval by Vide following Letter No. (previously E part VIII): TIAT offers the first-ever basic\r\n                                maintenance training organization in India with a full-fledged AR/VR lab (Augmented\r\n                                Reality/ Virtual Reality) wherein students can gain a realistic understanding of\r\n                                aircraft systems and their various components. TIAT under the flagship of Thakur\r\n                                Shyamnarayan Degree College received Approval to conduct B.Sc.Aeronautics\r\n                                Courses (Mechanical & Avionics) in affiliation with Mumbai University. TIAT trains its students after 10\r\n                                + 2 with PCM for a duration approx of 2 to 2.5 years (2400 hours completion) wherein the students undergo the\r\n                                basic theoretical and practical aspects including intense practical training in\r\n                                a real environment in various airlines. It has a responsibility to provide\r\n                                quality education and practical experience to students so that they meet the\r\n                                expectations set by the aviation industry worldwide. Thakur Institute of Aviation\r\n                                Technology has been awarded the Academic Leadership Award for 'Best Aircraft\r\n                                Maintenance Engineering Institute in India' by the MRO Association of India. TIAT also ranks top amongst all the\r\n                                AME (Aircraft Maintenance Engineering) colleges in India. It offers state-of-the-art\r\n                                infrastructure, the latest and updated technology, experienced faculties, a\r\n                                well-structured and thorough curriculum, and the best placement assistance in\r\n                                national and international aviation industries. TIAT comprehensively encourages\r\n                                students for their all-round holistic growth and development. Today's education sector is actively\r\n                                dominated by the latest technology and digital revolution. Thakur Institute of\r\n                                Aviation\r\n                                Technology leaves no stone unturned and offers its students with the finest\r\n                                technological educational practices such as Virtual Reality (VR) and Augmented\r\n                                Reality\r\n                                (AR), Microsoft HoloLens Mixed Reality (MR), sensors, and 3D visualization equipment\r\n                                such as CAVE Automatic Virtual Environment amongst various others. TIAT has taken\r\n                                this\r\n                                commendable step towards redefining education and enabling futuristic digital\r\n                                content in\r\n                                the classrooms to take practical education on a completely different level. This\r\n                                will\r\n                                help the students to comprehend the aircraft systems and components with a more\r\n                                realistic approach. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in TIAT is the first institute to ever launch a Basic Maintenance Training Organization in India to\r\n                    get approval from following international certification to impart basic Aircraft Maintenance\r\n                    Training. In order to engage the students in a more practical and empirical experience, TIAT also entered\r\n                    into several joint ventures with International Part-147 organizations to provide diverse\r\n                    aircraft\r\n                    training. Thakur Institute of Aviation Technology has taken upon the responsibility of providing\r\n                    its students with international standards of practical experience and preparing them to stand up\r\n                    to\r\n                    the high expectations and demands of the aviation industry. NEWS FLASH × About Why TIAT ? National & International Approvals Approval Certificates (National/Internaitonal) Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / About Thakur Institute of Aviation Technology TIAT's National Approvals TIAT's International Approvals TIAT is deemed the 'Best AME\r\n                                Training Institute' in India. Step into the Virtual world with TIAT State-of-the-Art Infrastructure at TIAT About TIAT Quick links Contact us To Impact Basic training to the Students of Aircraft Maintenance\r\n                                Engineering as per\r\n                                CAR\r\n                                147 (Basic) which includes catagories Please fill the details About Us B1.1 (Heavy Aeroplane and Turbine Engine), B1.3 (Helicopter and Turbine Engine) and B2 (Avionics) EASA (European Union Aviation Safety Agency), GCAA- (General Civil Aviation Authority, UAE) BCCA (Bhutan Civil Aviation Authority) and CAAB (Civil Aviation Authority of Bangladesh ) EASA PART 147 approval for Type Training of the A320 family along\r\n                            with CEO and NEO engines 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO Worls Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory DGCA/CAR/147(B)/07 dated (07/08/2018) to\r\n                                    impart basic training for Categories B1.1 (Heavy Aeroplane & Turbine Engine),\r\n                                    B1.3\r\n                                    (Helicopter & Turbine Engine) and B2 (Avionics)\r\n                                    approved by Directorate General of Civil\r\n                                    Aviation (D.G.C.A.), Government of India, New Delhi. Q3 TIAT / 1392 dated 24/03/2006,\r\n                                    Q3 TIAT / 5814 dated 21/11/2006, Q3\r\n                                    TIAT / 3629 dated 17/06/2008 under category ‘G’ Training School, to\r\n                                    impart ab-initio training in the field of Aircraft Maintenance Engineering for\r\n                                    obtaining Basic Licence in, Mechanical Stream: Heavy Aeroplane (HA), Light\r\n                                    Aeroplane\r\n                                    (LA), Jet Engine (JE) and Piston Engine (PE) Mechanical Stream: Rotary Wing\r\n                                    (RA),\r\n                                    Jet Engine (JE) and Piston Engine (PE) and Avionics Stream : Electrical System\r\n                                    (ES),\r\n                                    Instrument System (IS) and Radio Navigation System (RN). European Union Aviation Safety\r\n                                    Agency (EASA) General Civil Aviation Authority\r\n                                    (GCAA)of UAE EASA Part 147 Approval For Type\r\n                                    Training of A320 family alongwith CEO & NEO engines. Bhutan Civil Aviation Authority\r\n                                    (BCAA) Civil Aviation Authority of Bangladesh\r\n                                    (CAAB) B1.1 (Heavy Aeroplane & Turbine\r\n                                    Engine) B1.3 (Helicopter & Turbine\r\n                                    Engine) B2 (Avionics) The infrastructure at TIAT Mumbai encompasses CAR145 approved NDT labs which gives\r\n                                    students exposure to other\r\n                                    peripherals of aircraft maintenance activities as well. TIAT's live aircraft includes a Cessna 150M, Learjet 24, and an Enstrom-280C\r\n                                    helicopter. TIAT has a capsule of Boeing 747-200:-Cabin & JT9D7Q engine, fully equipped\r\n                                    Turbofan Engine, Turbo Prop AI-20M, Cockpit and Fixed Wing, NLG, MLG of B747\r\n                                    system for demonstration. TIAT has a Virtual Cockpit Simulator. TIAT has made an official agreement with many national and international\r\n                                    airlines and MROs to provide practical training and assistance to its students. 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/about-tiat.php", "content": ",\r\n                            Mumbai established in March 2006 has\r\n                            been elevating aviation excellence in education for almost 18 years to produce more than\r\n                            2300\r\n                            students to top-tier professionals in the field of aviation maintenance. In a stride towards\r\n                            global\r\n                            recognition TIAT is poised to secure national and international approval for its AME/AML\r\n                            programs & offering a holistic learning experience that combines theoretical knowledge\r\n                            with\r\n                            practical skills, preparing students for successful careers in the dynamic field of Aircraft\r\n                            Maintenance Engineering with an aim to make its students soar high in the sky.\r\n                            Thakur Institute of Aviation Technology (TIAT) Mumbai is always striving to provide its\r\n                            students with the best, be it the latest state-of-the infrastructure, top-class training\r\n                            support,\r\n                            immensely experienced faculties, through and well-structured curriculum; TIAT also gears\r\n                            towards providing job training and assistance programs to the students. TIAT offers\r\n                        top-notch\r\n                        placement offers in various international and national aviation industries. Not just\r\n                        academics, but\r\n                        the institution never fails to focus on the overall holistic development of the students by\r\n                        encouraging them to participate in several co-curriculum activities and providing them with\r\n                        a\r\n                        platform to display and showcase their talents. TIAT has a long list of achievements and excellent badges National approval by Directorate of General Civil Aviation, New Delhi, India for courses offered\r\n                        in categories Approval by Vide following Letter No. (previously E part VIII): TIAT offers the first-ever basic\r\n                                maintenance training organization in India with a full-fledged AR/VR lab (Augmented\r\n                                Reality/ Virtual Reality) wherein students can gain a realistic understanding of\r\n                                aircraft systems and their various components. TIAT under the flagship of Thakur\r\n                                Shyamnarayan Degree College received Approval to conduct B.Sc.Aeronautics\r\n                                Courses (Mechanical & Avionics) in affiliation with Mumbai University. TIAT trains its students after 10\r\n                                + 2 with PCM for a duration approx of 2 to 2.5 years (2400 hours completion) wherein the students undergo the\r\n                                basic theoretical and practical aspects including intense practical training in\r\n                                a real environment in various airlines. It has a responsibility to provide\r\n                                quality education and practical experience to students so that they meet the\r\n                                expectations set by the aviation industry worldwide. Thakur Institute of Aviation\r\n                                Technology has been awarded the Academic Leadership Award for 'Best Aircraft\r\n                                Maintenance Engineering Institute in India' by the MRO Association of India. TIAT also ranks top amongst all the\r\n                                AME (Aircraft Maintenance Engineering) colleges in India. It offers state-of-the-art\r\n                                infrastructure, the latest and updated technology, experienced faculties, a\r\n                                well-structured and thorough curriculum, and the best placement assistance in\r\n                                national and international aviation industries. TIAT comprehensively encourages\r\n                                students for their all-round holistic growth and development. Today's education sector is actively\r\n                                dominated by the latest technology and digital revolution. Thakur Institute of\r\n                                Aviation\r\n                                Technology leaves no stone unturned and offers its students with the finest\r\n                                technological educational practices such as Virtual Reality (VR) and Augmented\r\n                                Reality\r\n                                (AR), Microsoft HoloLens Mixed Reality (MR), sensors, and 3D visualization equipment\r\n                                such as CAVE Automatic Virtual Environment amongst various others. TIAT has taken\r\n                                this\r\n                                commendable step towards redefining education and enabling futuristic digital\r\n                                content in\r\n                                the classrooms to take practical education on a completely different level. This\r\n                                will\r\n                                help the students to comprehend the aircraft systems and components with a more\r\n                                realistic approach. Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in TIAT is the first institute to ever launch a Basic Maintenance Training Organization in India to\r\n                    get approval from following international certification to impart basic Aircraft Maintenance\r\n                    Training. In order to engage the students in a more practical and empirical experience, TIAT also entered\r\n                    into several joint ventures with International Part-147 organizations to provide diverse\r\n                    aircraft\r\n                    training. Thakur Institute of Aviation Technology has taken upon the responsibility of providing\r\n                    its students with international standards of practical experience and preparing them to stand up\r\n                    to\r\n                    the high expectations and demands of the aviation industry. NEWS FLASH × About Why TIAT ? National & International Approvals Approval Certificates (National/Internaitonal) Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / About Thakur Institute of Aviation Technology TIAT's National Approvals TIAT's International Approvals TIAT is deemed the 'Best AME\r\n                                Training Institute' in India. Step into the Virtual world with TIAT State-of-the-Art Infrastructure at TIAT About TIAT Quick links Contact us To Impact Basic training to the Students of Aircraft Maintenance\r\n                                Engineering as per\r\n                                CAR\r\n                                147 (Basic) which includes catagories Please fill the details About Us B1.1 (Heavy Aeroplane and Turbine Engine), B1.3 (Helicopter and Turbine Engine) and B2 (Avionics) EASA (European Union Aviation Safety Agency), GCAA- (General Civil Aviation Authority, UAE) BCCA (Bhutan Civil Aviation Authority) and CAAB (Civil Aviation Authority of Bangladesh ) EASA PART 147 approval for Type Training of the A320 family along\r\n                            with CEO and NEO engines 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO Worls Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory DGCA/CAR/147(B)/07 dated (07/08/2018) to\r\n                                    impart basic training for Categories B1.1 (Heavy Aeroplane & Turbine Engine),\r\n                                    B1.3\r\n                                    (Helicopter & Turbine Engine) and B2 (Avionics)\r\n                                    approved by Directorate General of Civil\r\n                                    Aviation (D.G.C.A.), Government of India, New Delhi. Q3 TIAT / 1392 dated 24/03/2006,\r\n                                    Q3 TIAT / 5814 dated 21/11/2006, Q3\r\n                                    TIAT / 3629 dated 17/06/2008 under category ‘G’ Training School, to\r\n                                    impart ab-initio training in the field of Aircraft Maintenance Engineering for\r\n                                    obtaining Basic Licence in, Mechanical Stream: Heavy Aeroplane (HA), Light\r\n                                    Aeroplane\r\n                                    (LA), Jet Engine (JE) and Piston Engine (PE) Mechanical Stream: Rotary Wing\r\n                                    (RA),\r\n                                    Jet Engine (JE) and Piston Engine (PE) and Avionics Stream : Electrical System\r\n                                    (ES),\r\n                                    Instrument System (IS) and Radio Navigation System (RN). European Union Aviation Safety\r\n                                    Agency (EASA) General Civil Aviation Authority\r\n                                    (GCAA)of UAE EASA Part 147 Approval For Type\r\n                                    Training of A320 family alongwith CEO & NEO engines. Bhutan Civil Aviation Authority\r\n                                    (BCAA) Civil Aviation Authority of Bangladesh\r\n                                    (CAAB) B1.1 (Heavy Aeroplane & Turbine\r\n                                    Engine) B1.3 (Helicopter & Turbine\r\n                                    Engine) B2 (Avionics) The infrastructure at TIAT Mumbai encompasses CAR145 approved NDT labs which gives\r\n                                    students exposure to other\r\n                                    peripherals of aircraft maintenance activities as well. TIAT's live aircraft includes a Cessna 150M, Learjet 24, and an Enstrom-280C\r\n                                    helicopter. TIAT has a capsule of Boeing 747-200:-Cabin & JT9D7Q engine, fully equipped\r\n                                    Turbofan Engine, Turbo Prop AI-20M, Cockpit and Fixed Wing, NLG, MLG of B747\r\n                                    system for demonstration. TIAT has a Virtual Cockpit Simulator. TIAT has made an official agreement with many national and international\r\n                                    airlines and MROs to provide practical training and assistance to its students. 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory"}
{"url": "https://tiatmumbai.in/syllabus-b2.php", "content": "Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Syllabus Category B2 Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Course Module: 3,6,9A,10 & Examination Module Scheme: 3,6,9A,10 (Semester-I) Course Module: 4,5,7A,8 & Examination Module Scheme: 4,5,7A,8 (Semester-II) Course Module: 13,14 & Examination Module Scheme: 13,14 (Semester-III) Course Module: 13 & Examination Module Scheme: 13 (Semester-IV) About TIAT Quick links Contact us Note: Please fill the details Syllabus Category B2 TH-Theory PR-Practical Course module is the module which will be taught in the particular semester. Examination module is the module of which exams will be conducted after completion of\r\n                                semester based on the consideration of the level & marks. Module 11A,12,13 and 15 are divided into two phase which will be covered in\r\n                                Semester-III and IV respectively 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory 1 3 Electrical Fundamental 2 6 Material & Hardware 3 9A Human Factor 4 10 Aviation Legislation 1 4 Electronics Fundamental 2 5 Digital Techniques / Electronics Instruments System 3 7A Maintenance Practices 4 8 Basic Aerodynamics 1 13 Aircraft Aerodynamics, Structure and system 2 14 Propulsion 1 13 Aircraft Aerodynamics, Structure and system"}
{"url": "https://tiatmumbai.in/syllabus-b1.3.php", "content": "Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Syllabus Category B1.3 Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Course Module: 3,6,9A,10 & Examination Module Scheme: 3,6,9A,10 (Semester-I) Course Module: 4,5,7A,8 & Examination Module Scheme: 4,5,7A,8 (Semester - II) Course Module: 12,15,17A & Examination Module Scheme: 12,15,17A (Semester -\r\n                            III) Course Module: 12,15 & Examination Module Scheme: 12,15 (Semester - IV) About TIAT Quick links Contact us Note: Please fill the details Syllabus Category B1.3 TH-Theory PR-Practical Course module is the module which will be taught in the particular semester. Examination module is the module of which exams will be conducted after completion of semester based on the consideration of the level & marks. Module 11A,12,13 and 15 are divided into two phase which will be covered in Semester-III and IV respectively 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory 1 3 Electrical Fundamental 2 6 Material & Hardware 3 9A Human Factor 4 10 Aviation Legislation 1 4 Electronics Fundamental 2 5 Digital Techniques / Electronics Instruments System 3 7A Maintenance Practices 4 8 Basic Aerodynamics 1 12 Helicopter Aerodynamics, Structures and Systems 2 15 Gas Turbine Engine 1 12 Helicopter Aerodynamics, Structures and Systems 2 15 Gas Turbine Engine"}
{"url": "https://tiatmumbai.in/syllabus-b1.1.php", "content": "Zagdu Singh Charitable Trust’s Thakur Insititute of\r\n                                Aviation Technology, Thakur Complex, 90 Feet Road,\r\n                                Near Western Express Highway, Kandivali(E). Mumbai – 400 101 tiat@thakureducation.org info@thakuraviation.edu.in NEWS FLASH × Syllabus Category B1.1 Admissions open for AME\r\n                            2024.... (No CET required) Apply Now / Course Module: 3,6,9A,10 & Examination Module Scheme: 3,6,9A,10 (Semester-I) Course Module: 4,5,7A,8 & Examination Module Scheme: 4,5,7A,8 (Semester-II) Course Module: 11A,15,17A & Examination Module Scheme: 11A,15,17A (Semester-III) Course Module: 11A,15 & Examination Module Scheme: 11A,15 (Semester-IV) About TIAT Quick links Contact us Note: Please fill the details Syllabus Category B1.1 TH-Theory PR-Practical Course module is the module which will be taught in the particular semester. Examination module is the module of which exams will be conducted after completion of\r\n                                semester based on the consideration of the level & marks. Module 11A,12,13 and 15 are divided into two phase which will be covered in Semester-III\r\n                                and IV respectively 18 Years of Academic Excellence More than 2300 students have enrolled in the course Actual Environment Training in India's Leading Airline & MRO World Class Amenities Placement: All around the Globe Experienced Instructors Modern Aids for Training Well equipped Hangars & Technical Laboratory 1 3 Electrical Fundamental 2 6 Material & Hardware 3 9A Human Factor 4 10 Aviation Legislation 1 4 Electronics Fundamental 2 5 Digital Techniques / Electronics Instruments System 3 7A Maintenance Practices 4 8 Basic Aerodynamics 1 11A Turbine Aeroplane Aerodynamics, Structures and Systems 2 15 Gas Turbine Engine 3 17A Propeller 1 11A Turbine Aeroplane Aerodynamics, Structures and Systems 2 15 Gas Turbine Engine"}
